{
  "billId": "119-hr-3062",
  "congress": 119,
  "type": "HR",
  "number": "3062",
  "title": "Promoting Cross-border Energy Infrastructure Act",
  "summary": "<p><strong>Promoting Cross-b</strong><strong>order Energy Infrastructure Act</strong></p><p>This bill establishes a new process for approving or revoking permits for the construction and operation of energy infrastructure across an international border of the United States. Thus, it replaces the existing process established under specified executive orders.</p><p>The bill requires a person to obtain a certificate of crossing before constructing, connecting, operating, or maintaining a border-crossing facility for the import or export of oil or natural gas,&nbsp;or the transmission of electricity, across a U.S. border with Canada or Mexico. A certificate must be obtained from the Federal Energy Regulatory Commission (FERC) for a facility consisting of oil or natural gas pipelines or the Department of Energy (DOE) for an electric transmission facility. As a condition of issuing a certificate, DOE must require that an electric transmission facility be constructed, connected, operated, or maintained consistent with specified policies and standards.</p><p>FERC and DOE must meet a deadline for issuing a certificate as set forth by this bill. The bill also requires FERC to meet a deadline for approving applications to import or export natural gas to or from Canada or Mexico.</p><p>The bill also requires the President to obtain the approval of Congress before revoking a permit issued under executive orders for constructing, connecting, operating, or maintaining an oil or natural gas pipeline, an electric transmission facility, or a related border-crossing facility.</p>",
  "latestAction": {
    "actionDate": "2025-09-19",
    "text": "Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources."
  },
  "subjects": [
    "Administrative law and regulatory procedures",
    "Canada",
    "Department of Energy",
    "Electric power generation and transmission",
    "Environmental assessment, monitoring, research",
    "Federal Energy Regulatory Commission (FERC)",
    "Latin America",
    "Licensing and registrations",
    "Mexico",
    "Oil and gas",
    "Pipelines",
    "Trade restrictions"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3062"
}