{
  "billId": "119-hr-2988",
  "congress": 119,
  "type": "HR",
  "number": "2988",
  "title": "Protecting Prudent Investment of Retirement Savings Act",
  "summary": "<p><strong>Protecting Prudent Investment of Retirement Savings Act</strong></p><p>This bill modifies the requirements for fiduciaries of employer-sponsored retirement plans.</p><p>First, the bill generally requires a plan fiduciary to make investment decisions based solely&nbsp;on pecuniary factors (i.e., factors that a fiduciary prudently determines are expected to have a material effect on the risk or return of an investment based on appropriate investment horizons consistent with the plan's policies and objectives).</p><p>The bill allows nonpecuniary factors to be considered in certain situations, such as when selecting investment options for certain participant-directed retirement plans or if the fiduciary is unable to distinguish between investment alternatives on the basis of pecuniary factors alone.</p><p>The bill also prohibits a plan fiduciary from discriminating when selecting, monitoring, and retaining any fiduciary, counsel, employee, or service provider of the plan.</p><p>The bill requires a plan fiduciary to act solely and prudently in accordance with the interests of the plan's&nbsp;participants and beneficiaries when exercising a shareholder right (e.g., voting of proxies). However, the fiduciary duty to manage shareholder rights does not require the voting of every proxy or the exercise of every shareholder right.</p><p>Finally, the bill requires a plan fiduciary to provide specified notices with respect to a pension plan that provides a participant or beneficiary the opportunity to select from designated investment alternatives.</p>",
  "latestAction": {
    "actionDate": "2026-01-26",
    "text": "Received in the Senate and Read twice and referred to the Committee on Health, Education, Labor, and Pensions."
  },
  "subjects": [
    "Business ethics",
    "Employee benefits and pensions",
    "Financial services and investments"
  ],
  "cosponsors": 0,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/2988"
}