{
  "billId": "119-s-5",
  "congress": 119,
  "type": "S",
  "number": "5",
  "title": "Laken Riley Act",
  "summary": "<p><strong>Laken Riley Act</strong></p><p>This bill requires the Department of Homeland Security (DHS) to detain certain non-U.S. nationals (<em>aliens</em> under federal law) who have been arrested for burglary, theft, larceny, or shoplifting. The bill also authorizes states to sue the federal government for decisions or alleged failures related to immigration enforcement.</p><p>Under this bill, DHS must detain an individual who (1) is unlawfully present in the United States or did not possess the necessary documents when applying for admission; and (2) has been charged with, arrested for, convicted of, or admits to having committed acts that constitute the essential elements of burglary, theft, larceny, or shoplifting.</p><p>The bill also authorizes state governments to sue for injunctive relief over certain immigration-related decisions or alleged failures by the federal government if the decision or failure caused the state or its residents harm, including financial harm of more than $100. Specifically, the state government may sue the federal government over a</p><ul><li>decision to release a non-U.S. national from custody;</li><li>failure to fulfill requirements relating to inspecting individuals seeking admission into the United States, including requirements related to asylum interviews;</li><li>failure to fulfill a requirement to stop issuing visas to nationals of a country that unreasonably denies or delays acceptance of nationals of that country;</li><li>violation of limitations on immigration parole, such as the requirement that parole be granted only on a case-by-case basis; or</li><li>failure to detain an individual who has been ordered removed from the United States.</li></ul>",
  "latestAction": {
    "actionDate": "2025-01-29",
    "text": "Became Public Law No: 119-1."
  },
  "subjects": [
    "Border security and unlawful immigration",
    "Civil actions and liability",
    "Crimes against property",
    "Criminal investigation, prosecution, interrogation",
    "Detention of persons",
    "Immigration status and procedures",
    "Intergovernmental relations",
    "Refugees, asylum, displaced persons",
    "State and local government operations",
    "Violent crime",
    "Visas and passports"
  ],
  "cosponsors": 53,
  "url": "https://www.congress.gov/bill/119th-congress/senate-bill/5"
}