{
  "billId": "119-hr-3616",
  "congress": 119,
  "type": "HR",
  "number": "3616",
  "title": "Reliable Power Act",
  "summary": "<p><strong>Reliable Power Act</strong></p><p>This bill directs the electric reliability organization (i.e., the North American Electric Reliability Corporation) to conduct annual long-term assessments of the reliability of electric power in the bulk-power system. It also&nbsp;establishes a process for the Federal Energy Regulatory Commission (FERC) to review federal regulations before they are finalized if the electric reliability organization finds that&nbsp;the system is at risk of not having sufficient electric generation to maintain reliability.</p><p>If the electric reliability organization finds that the system does not have sufficient generation to maintain reliability, it must notify FERC that the bulk-power system is in a state of generation inadequacy. FERC must then notify the Department of Energy, the Environmental Protection Agency, and any other appropriate federal agencies of the generation inadequacy. Upon receiving the notice, the federal agency must provide proposed regulations that affect any generation resource in the bulk-power system to FERC for review and comment. If applicable, FERC must provide recommendations to modify the regulations. Federal agencies may not finalize such a regulation until&nbsp;FERC finds that it will not be likely to have a significant negative impact on the ability of the bulk-power system to supply sufficient electric energy necessary to maintain an adequate level of reliability.</p>",
  "latestAction": {
    "actionDate": "2025-12-18",
    "text": "Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources."
  },
  "subjects": [
    "Congressional oversight",
    "Electric power generation and transmission",
    "Energy efficiency and conservation",
    "Energy storage, supplies, demand",
    "Government information and archives",
    "Government studies and investigations"
  ],
  "cosponsors": 20,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3616"
}