{
  "billId": "119-hr-2483",
  "congress": 119,
  "type": "HR",
  "number": "2483",
  "title": "SUPPORT for Patients and Communities Reauthorization Act of 2025",
  "summary": "<p><strong>SUPPORT for Patients and Communities Reauthorization Act of 2025</strong></p><p>This bill reauthorizes and revises Department of Health and Human Services (HHS) programs  that address substance use disorders, overdoses, and mental health. </p><p>For example, the bill reauthorizes for FY2026-FY2030&nbsp;grant and other programs&nbsp;relating to</p><p>• &nbsp; &nbsp;addressing&nbsp;substance use disorders with respect to pregnant and postpartum women,<br/>• &nbsp; &nbsp;prevention and recovery from substance use disorders for youth,&nbsp;<br/>• &nbsp; &nbsp;housing for individuals in recovery from substance use disorders,<br/>• &nbsp; &nbsp;community organizations facilitating recovery from substance use disorders,<br/>• &nbsp; &nbsp;loan repayment for certain health care providers treating substance use disorders,&nbsp;<br/>• &nbsp; &nbsp;prevention of overdoses of controlled substances,<br/>• &nbsp; &nbsp;treatment of children experiencing psychological trauma, and<br/>• &nbsp; &nbsp;mental and behavioral health education and training for medical and allied health students.</p><p>Also, the bill revises several programs,&nbsp;including by (1) expanding a program that supports resources for first responders to include the purchase of&nbsp;drugs or devices to treat non-opioid overdoses, (2) expanding a program that supports employment services for&nbsp;individuals in recovery so as to allow for the provision of related transportation services, and (3) temporarily authorizing a regional technical assistance center&nbsp;to assist the&nbsp;National Peer-Run Training and Technical Assistance Center for Addiction Recovery Support.</p><p>Additionally, the bill establishes new requirements for&nbsp;HHS, including requirements relating to</p><p>• &nbsp; &nbsp;protecting the National Suicide Prevention Lifeline program from cybersecurity threats,<br/>• &nbsp; &nbsp;establishing a Federal Interagency Work Group on Fentanyl Contamination of Illegal Drugs, and<br/>• &nbsp; &nbsp;reviewing and potentially revising the scheduling of approved products containing a combination of buprenorphine and naloxone under the Controlled Substances Act.</p>",
  "latestAction": {
    "actionDate": "2025-12-01",
    "text": "Became Public Law No: 119-44."
  },
  "subjects": [
    "Advisory bodies",
    "Child health",
    "Community life and organization",
    "Computer security and identity theft",
    "Congressional oversight",
    "Drug trafficking and controlled substances",
    "Drug, alcohol, tobacco use",
    "Emergency communications systems",
    "Employment and training programs",
    "Family services",
    "First responders and emergency personnel",
    "Government information and archives",
    "Government lending and loan guarantees",
    "Government studies and investigations",
    "Health care coverage and access",
    "Health information and medical records",
    "Health personnel",
    "Health programs administration and funding",
    "Health promotion and preventive care"
  ],
  "cosponsors": 1,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/2483"
}