{
  "billId": "119-hr-6644",
  "congress": 119,
  "type": "HR",
  "number": "6644",
  "title": "Housing for the 21st Century Act",
  "summary": "<p><strong>Housing for the 21st Century Act<br/><br/></strong>This bill revises federal housing programs, including by expanding available financing for affordable housing and providing grants for planning and community development activities.<br/><br/>For example, the bill increases the statutory maximum loan limits for mortgage insurance programs administered by the&nbsp;Federal Housing Administration&nbsp;for multifamily homes and requires the use of a more specific inflation index for such loans.<br/><br/>The bill also increases the maximum&nbsp;eligible income for the Department of Housing and Urban Development's (HUD's) HOME Investment Partnerships Program (grants to states and localities to support housing for low-income households) and&nbsp;establishes a grant program to assist regional, state, and local entities with&nbsp;strategies to support affordable housing.<br/><br/>In addition, the bill</p><ul><li>exempts certain housing-related activities from the environmental review process, including certain construction, improvement, or rehabilitation of residential buildings;</li><li>excludes veterans' disability benefits from being considered as income for purposes of determining eligibility for the Veterans Affairs Supportive Housing (VASH) program;</li><li>establishes a pilot program to provide grants to public housing agencies (PHAs) and other owners of federally assisted housing to  test the efficacy of temperature sensors to support compliance with temperature requirements;</li><li>eliminates the requirement that manufactured homes must be constructed with a permanent chassis; and</li><li>authorizes HUD to conduct performance reviews of organizations that&nbsp;provide&nbsp;housing counseling services.</li></ul><p>The bill also expands oversight of HUD and PHAs, such as by requiring PHAs to post information about contracts on their websites.</p><p>For more information about this bill, see <a href=\"https://www.congress.gov/crs-product/R48849#_Toc221206484\">CRS Report&nbsp;</a><a href=\"https://www.congress.gov/crs-product/R48849#_Toc221206484\">R48849</a>.&nbsp;</p>",
  "latestAction": {
    "actionDate": "2026-02-11",
    "text": "Received in the Senate."
  },
  "subjects": [
    "Administrative law and regulatory procedures",
    "Advisory bodies",
    "Congressional oversight",
    "Department of Housing and Urban Development",
    "Disability assistance",
    "Environmental assessment, monitoring, research",
    "Government information and archives",
    "Government studies and investigations",
    "Housing and community development funding",
    "Housing finance and home ownership",
    "Housing industry and standards",
    "Housing supply and affordability",
    "Land use and conservation",
    "Landlord and tenant",
    "Licensing and registrations",
    "Low- and moderate-income housing",
    "Performance measurement",
    "Public housing",
    "Regional and metropolitan planning"
  ],
  "cosponsors": 31,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/6644"
}