{
  "billId": "119-hr-3425",
  "congress": 119,
  "type": "HR",
  "number": "3425",
  "title": "Personnel Oversight and Shift Tracking Act of 2025",
  "summary": "<p><strong>Personnel Oversight and Shift Tracking Act of 2025 or the POST Act of 2025</strong></p><p>The bill directs the Federal Protective Service (FPS) to improve the performance of security personnel contracted to protect federal buildings and to report on such efforts to Congress.</p><p>Within one year after the bill's enactment, FPS must establish performance testing and improvement protocols for contract security personnel. Specifically, FPS shall (1) establish standards for the collection, maintenance, and analysis of covert testing data; (2) conduct quarterly analytical reviews of covert testing data to identify trends and opportunities for operational improvement; (3) establish a mandatory, cause-specific corrective training and performance improvement plan for any individual who fails a covert test; and (4) update security training guidance to address failed covert tests, emerging threats, and best practices. FPS must&nbsp;report to Congress about implementation upon&nbsp;completion and annually thereafter.&nbsp;</p><p>Within&nbsp;180 days after the bill’s enactment, FPS must assess whether to replace or upgrade its tracking system for managing and monitoring the deployment availability of contract security personnel. FPS must&nbsp;develop (1) an implementation plan that includes a timeline for the replacement or update;&nbsp;and (2) procedures to ensure timely and accurate communication to building tenants regarding contract security personnel absences or other gaps in coverage.&nbsp;FPS must report to Congress on the assessment within one year after the bill's enactment&nbsp;and annually for the next three years.</p>",
  "latestAction": {
    "actionDate": "2025-09-09",
    "text": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs."
  },
  "subjects": [
    "Computers and information technology",
    "Congressional oversight",
    "Employment and training programs",
    "Government buildings, facilities, and property",
    "Government employee pay, benefits, personnel management",
    "Performance measurement",
    "Personnel records"
  ],
  "cosponsors": 1,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3425"
}