{
  "billId": "119-hr-3617",
  "congress": 119,
  "type": "HR",
  "number": "3617",
  "title": "Securing America’s Critical Minerals Supply Act",
  "summary": "<p><strong>Securing America's Critical Minerals Supply Act</strong></p><p>This bill requires the Department of Energy (DOE) to secure the supply of critical energy resources that are essential to the energy security of the United States. A&nbsp;<em>critical energy resource</em> means an energy resource (1) that is essential to the energy sector and energy systems of the United States, and (2) the supply chain of which is vulnerable to disruption.</p><p>As part of its duties, DOE must&nbsp;conduct ongoing assessments of</p><ul><li>energy&nbsp;resource criticality,</li><li>the U.S. supply chain of critical energy resources and its vulnerabilities,&nbsp;</li><li>the diversity of domestic critical energy resource supply chains,</li><li>capacity constraints on the domestic production of critical energy resources,</li><li>federal regulations affecting the domestic production or importation of critical energy resources,&nbsp;</li><li>how energy security is affected by reliance on imports of&nbsp;critical energy resources, and&nbsp;</li><li>how adversarial nations seek&nbsp;to exploit critical energy resource markets to undermine investment in the United States.</li></ul><p>DOE must also</p><ul><li>facilitate the&nbsp;development of strategies to&nbsp;strengthen&nbsp;critical energy resource supply chains,</li><li>develop substitutes and alternatives to critical energy resources, and</li><li>improve technology that reuses and recycles critical energy resources.</li></ul>",
  "latestAction": {
    "actionDate": "2026-02-12",
    "text": "Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources."
  },
  "subjects": [
    "Energy research",
    "Energy storage, supplies, demand",
    "Government information and archives",
    "Government studies and investigations",
    "Mining",
    "Research and development",
    "Strategic materials and reserves"
  ],
  "cosponsors": 4,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3617"
}