{
  "billId": "119-hr-22",
  "congress": 119,
  "type": "HR",
  "number": "22",
  "title": "SAVE Act",
  "summary": "<p><strong>Safeguard American Voter Eligibility Act or the SAVE Act</strong></p><p>This bill requires individuals to provide documentary proof of U.S. citizenship when registering to vote in federal elections.</p><p>Specifically, the bill prohibits states from accepting and processing an application to register to vote in a federal election unless the applicant presents documentary proof of U.S. citizenship.&nbsp;The bill specifies what documents are considered acceptable proof of U.S. citizenship, such as&nbsp;identification that complies with the REAL ID Act of 2005 that indicates U.S. citizenship.</p><p>Further, the bill (1) prohibits states from registering an individual to vote in a federal election unless, at the time the individual applies to register to vote, the individual provides documentary proof of U.S. citizenship; and (2) requires states to establish an alternative process under which an applicant may submit other evidence to demonstrate U.S. citizenship.</p><p>Each state must take affirmative steps on an ongoing basis to ensure that only U.S. citizens are registered to vote, which shall include establishing a program to identify individuals who are not U.S. citizens using information supplied by certain sources.</p><p>Additionally, states must remove noncitizens from their official lists of eligible voters.</p><p>The bill allows for a private right of action against an election official who registers an applicant to vote in a federal election who fails to present documentary proof of U.S. citizenship.</p><p>The bill establishes criminal penalties for certain offenses, including registering an applicant to vote in a federal election who fails to present documentary proof of U.S. citizenship.</p>",
  "latestAction": {
    "actionDate": "2025-04-10",
    "text": "Received in the Senate."
  },
  "subjects": [
    "Citizenship and naturalization",
    "Civil actions and liability",
    "Criminal procedure and sentencing",
    "Election Assistance Commission",
    "Elections, voting, political campaign regulation",
    "Government information and archives",
    "Immigration status and procedures",
    "Licensing and registrations",
    "Postal service",
    "State and local government operations",
    "Voting rights"
  ],
  "cosponsors": 110,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/22"
}