{
  "billId": "119-hr-747",
  "congress": 119,
  "type": "HR",
  "number": "747",
  "title": "Stop Chinese Fentanyl Act of 2025",
  "summary": "<p><strong>Stop Chinese Fentanyl Act of 2025</strong></p><p>This bill subjects certain Chinese entities and government officials to potential sanctions related to opioid trafficking and requires the President to conduct certain preliminary analyses before regulating economic transactions in the event of a national emergency related to international drug trafficking.&nbsp;</p><p>Specifically, for the purposes of the Fentanyl Sanctions Act, the bill changes the definition of foreign opioid trafficker to specify that the term includes (1) Chinese entities involved in the production or sale of synthetic opioids or related pharmaceutical ingredients that fail to take steps to detect or prevent opioid trafficking; and (2) certain senior Chinese government officials that aid and abet opioid trafficking, including through intentional inaction. Under current law, the President must impose certain sanctions on individuals and entities identified as foreign opioid traffickers.</p><p>Further, the bill extends through 2029 an existing requirement that the President report to Congress annually on identified foreign opioid traffickers and any sanctions imposed on them. (This requirement expired in December 2024.)</p><p>The bill also requires the President to take additional steps in issuing regulations under the International Emergency Economic Powers Act&nbsp;(IEEPA) pursuant to a declared national emergency related to international drug trafficking. (IEEPA authorizes the President to regulate a variety of economic transactions following a declaration of national emergency.) Under the bill, the President must evaluate the costs and benefits of issuing economic&nbsp;regulations for the purpose of resolving the drug trafficking emergency and publish a discussion of such costs and benefits.</p>",
  "latestAction": {
    "actionDate": "2025-09-03",
    "text": "Received in the Senate and Read twice and referred to the Committee on Banking, Housing, and Urban Affairs."
  },
  "subjects": [
    "Asia",
    "China",
    "Civil actions and liability",
    "Congressional oversight",
    "Drug trafficking and controlled substances",
    "Presidents and presidential powers, Vice Presidents",
    "Sanctions",
    "Smuggling and trafficking"
  ],
  "cosponsors": 9,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/747"
}