{
  "billId": "119-hr-5371",
  "congress": 119,
  "type": "HR",
  "number": "5371",
  "title": "Continuing Appropriations, Agriculture, Legislative Branch, Military Construction and Veterans Affairs, and Extensions Act, 2026",
  "summary": "<p><strong>Continuing Appropriations and Extensions Act, 2026</strong></p><p>This bill provides continuing FY2026 appropriations for federal agencies, provides additional funding for security for federal officials, and extends various expiring programs and authorities.</p><p>Specifically, the bill provides continuing FY2026 appropriations to federal agencies through the earlier of November 21, 2025, or the enactment of the applicable appropriations act. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2026 appropriations bills have not been enacted when FY2026 begins on October 1, 2025.&nbsp;</p><p>The CR funds most programs and activities at the FY2025 levels with several exceptions that provide funding flexibility and additional appropriations for various programs.</p><p>For example, the CR provides additional funding for security for Members of Congress, Supreme Court Justices, and executive branch officials. It also authorizes the District of Columbia to spend local funds at the rates included in its FY2026 local budget.</p><p>In addition, the bill extends several expiring programs and authorities, including</p><ul><li>several public health, Medicare, and Medicaid authorities and programs;</li><li>various programs and authorities related to veterans;</li><li>the U.S. Grain Standards Act;</li><li>the Department of Agriculture livestock mandatory price reporting program;</li><li>several Department of Homeland Security (DHS) programs related to cybersecurity;</li><li>authorities for DHS and the Department of Justice to take actions to mitigate a credible threat from an unmanned aircraft system;</li><li>the special assessment on nonindigent persons or entities convicted of certain offenses involving sexual abuse or human trafficking;</li><li>authorities related to the Commodity Futures Trading Commission whistleblower program; and</li><li>the Defense Production Act of 1950.</li></ul>",
  "latestAction": {
    "actionDate": "2025-11-12",
    "text": "Became Public Law No: 119-37."
  },
  "subjects": [
    "Abortion",
    "Access Board",
    "Accounting and auditing",
    "Administrative law and regulatory procedures",
    "Administrative remedies",
    "Adoption and foster care",
    "Advanced technology and technological innovations",
    "Advisory bodies",
    "Afghanistan",
    "Africa",
    "African Development Foundation",
    "Aging",
    "Agricultural conservation and pollution",
    "Agricultural education",
    "Agricultural equipment and machinery",
    "Agricultural insurance",
    "Agricultural marketing and promotion",
    "Agricultural practices and innovations",
    "Agricultural prices, subsidies, credit"
  ],
  "cosponsors": 0,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/5371"
}