{
  "billId": "119-hr-1717",
  "congress": 119,
  "type": "HR",
  "number": "1717",
  "title": "Communications Security Act",
  "summary": "<p><strong>Communications Security Act</strong></p><p>This bill provides statutory authority for a council established by the Federal Communications Commission (FCC) to provide advice regarding the security, reliability, and interoperability of communications networks. (This advice is currently provided by the FCC’s Communications Security, Reliability, and Interoperability Council.)</p><p>The bill specifies that the FCC may designate an existing advisory committee to fulfill this role, provided the committee’s membership is modified, as necessary, to comply with membership requirements set forth in the bill.&nbsp;</p><p>Specifically, the bill requires the council to include, to the extent practicable, representatives of companies in the communications industry; public interest organizations or academic institutions; and federal, state, tribal, and local governments (with at least one member representing each level of government). Members are to be selected by the FCC's chair&nbsp;and generally may not include representatives of entities owned or controlled by, or subject to the influence of, a foreign adversary, or otherwise deemed to pose a threat to U.S. national security.&nbsp;</p><p>Under current law, federal advisory committees&nbsp;must generally terminate after two years unless they are renewed or a statute specifies a different termination date. However, the bill exempts the council from this requirement.</p>",
  "latestAction": {
    "actionDate": "2025-07-16",
    "text": "Received in the Senate and Read twice and referred to the Committee on Commerce, Science, and Transportation."
  },
  "subjects": [
    "Broadcasting, cable, digital technologies",
    "Computer security and identity theft",
    "Congressional oversight",
    "Executive agency funding and structure",
    "Federal Communications Commission (FCC)",
    "Government studies and investigations",
    "Internet, web applications, social media",
    "Public-private cooperation",
    "State and local government operations",
    "Telephone and wireless communication"
  ],
  "cosponsors": 1,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1717"
}