{
  "billId": "119-hr-471",
  "congress": 119,
  "type": "HR",
  "number": "471",
  "title": "Fix Our Forests Act",
  "summary": "<p><strong>Fix Our Forests Act</strong></p><p>This bill establishes requirements for managing forests on federal land, including requirements concerning reducing wildfire threats, expediting the review of certain forest management projects, and implementing forest management projects and other activities.</p><p>Specifically, the bill (1)&nbsp;designates certain firesheds&nbsp;at high risk for wildfires as fireshed management areas; (2) directs the U.S. Forest Service and U.S. Geological Survey to jointly establish an interagency Fireshed Center that is responsible for duties related to assessing and predicting fire, including maintaining a fireshed registry on a publicly accessible website that provides interactive geospatial data on individual firesheds; and (3) makes other requirements related to reducing wildfire.</p><p>Next, the bill expedites the review of certain forest management projects under the National Environmental Policy Act (NEPA) of 1969 and exempts certain activities from NEPA review. It also establishes intra-agency strike teams to accelerate the review and any interagency consultation processes under NEPA, the Endangered Species Act of 1973, and the National Historic Preservation Act. It also limits consultation requirements concerning threatened and endangered species under the Forest and Rangeland Renewable Resources Planning Act of 1974 and the Federal Land Management and Policy Act of 1976. Finally, it limits litigation involving fireshed management projects and limits remedies that courts may provide.</p><p>Additionally, the bill supports reducing community wildfire risks, carrying out forest restoration and stewardship activities (including watershed protection and restoration), conducting biochar demonstration projects, advancing technologies to address forest wildfires, and assisting wildland firefighters and their families.</p>",
  "latestAction": {
    "actionDate": "2025-03-06",
    "text": "Committee on Agriculture, Nutrition, and Forestry Subcommittee on Conservation, Forestry, Natural Resources, and Biotechnology. Hearings held. With printed Hearing: S.Hrg. 119-27."
  },
  "subjects": [
    "Administrative law and regulatory procedures",
    "Agricultural practices and innovations",
    "Alternative and renewable resources",
    "Building construction",
    "California",
    "Climate change and greenhouse gases",
    "Community life and organization",
    "Computers and information technology",
    "Congressional oversight",
    "Department of Agriculture",
    "Department of the Interior",
    "Ecology",
    "Emergency planning and evacuation",
    "Environmental assessment, monitoring, research",
    "Executive agency funding and structure",
    "Federal officials",
    "Fires",
    "First responders and emergency personnel",
    "Forests, forestry, trees"
  ],
  "cosponsors": 56,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/471"
}