{
  "billId": "119-hr-1402",
  "congress": 119,
  "type": "HR",
  "number": "1402",
  "title": "TICKET Act",
  "summary": "<p><strong>Transparency In Charges for Key Events Ticketing Act or the TICKET Act</strong></p><p>This bill requires ticket sellers (including sellers on the secondary market) for concerts, performances, sporting events, and similar activities to clearly and prominently disclose the total ticket price for the event&nbsp;at the time the ticket is first displayed to an individual (and anytime thereafter during the purchasing process). Prior to completing a purchase, ticket sellers also must provide an itemized list of the base ticket price and each fee (e.g., service fee, processing fee, or other charge). The total ticket price must also be disclosed in any advertisement, marketing, or price list.</p><p>Additionally, a ticket seller, secondary market seller, or ticket exchange that does not have actual or constructive possession of an event ticket is prohibited from selling or advertising a ticket for the event. However, a secondary market seller or exchange may sell or advertise a service to obtain an event ticket for an individual&nbsp;if the seller or exchange (1) does not market the service as an event ticket, (2) maintains a clear separation between the provided service and the event tickets throughout the entire purchasing process, and (3) clearly discloses that the service is not an event ticket.</p><p>The bill establishes additional disclosure requirements for&nbsp;ticket sellers, secondary market sellers, and ticket exchanges, and requires such entities to issue a refund for the total ticket price if an event is canceled or postponed.</p><p>The Federal Trade Commission must enforce these requirements.</p>",
  "latestAction": {
    "actionDate": "2025-09-16",
    "text": "Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 163."
  },
  "subjects": [
    "Competition and antitrust",
    "Consumer affairs",
    "Inflation and prices",
    "Marketing and advertising",
    "Service industries",
    "User charges and fees"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1402"
}