{
  "billId": "119-hr-3486",
  "congress": 119,
  "type": "HR",
  "number": "3486",
  "title": "Stop Illegal Entry Act of 2025",
  "summary": "<p><strong>Stop Illegal Reentry Act</strong></p><p>This bill establishes or increases&nbsp;criminal penalties for certain non-U.S. nationals (<em>aliens</em> under federal law) who illegally enter the United States and then commit a felony&nbsp;or illegally reenter the United States.</p><p>The bill establishes a mandatory minimum prison term of 5 years and allows a life sentence for an individual who (1)&nbsp;improperly enters, or attempts to improperly enter, the United States; and (2) is subsequently convicted of a felony.</p><p>The bill increases the maximum term of imprisonment from 2 years to 5 years for repeated improper entry.&nbsp;</p><p>The bill also increases from 2 years to 10 years the maximum term of imprisonment for an individual who had been denied entry into or removed from the United States and who later enters or attempts to enter without prior approval. The bill increases the maximum term of imprisonment from 10 to 15 years if such an individual was convicted of three or more specified types of misdemeanors before removal.</p><p>An individual who had been denied entry or removed three or more times and who later enters or attempts to enter the United States shall be fined, imprisoned for up to 10 years, or both.</p><p>The bill establishes a mandatory minimum term of imprisonment of 10 years and allows a life sentence for an individual who was convicted of a felony before removal, or convicted of illegal reentry at least two times before removal, and who subsequently enters or tries to enter the United States.&nbsp;</p>",
  "latestAction": {
    "actionDate": "2025-09-15",
    "text": "Received in the Senate."
  },
  "subjects": [
    "Border security and unlawful immigration",
    "Criminal justice information and records",
    "Criminal procedure and sentencing",
    "Detention of persons",
    "Immigration status and procedures",
    "Violent crime"
  ],
  "cosponsors": 5,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3486"
}