{
  "billId": "119-hr-1968",
  "congress": 119,
  "type": "HR",
  "number": "1968",
  "title": "Full-Year Continuing Appropriations and Extensions Act, 2025",
  "summary": "<p><strong>Full-Year Continuing Appropriations and Extensions Act, 2025</strong></p><p>This bill provides continuing FY2025 appropriations for federal agencies and extends various expiring programs and authorities.&nbsp;</p><p>Specifically, the bill provides continuing FY2025 appropriations to federal agencies for the remainder of FY2025. It is known as a continuing resolution (CR) and prevents a government shutdown that would otherwise occur if the FY2025 appropriations bills have not been enacted when the existing CR expires on March 14, 2025.&nbsp;</p><p>The CR funds most programs and activities at the FY2024 levels. It also includes several additional provisions that increase or decrease funding for various programs compared to FY2024 levels.&nbsp;</p><p>In addition, the bill extends several expiring programs and authorities, including</p><ul><li>several public health, Medicare, and Medicaid authorities and programs;</li><li>the National Flood Insurance Program;</li><li>authorities related to the Commodity Futures Trading Commission whistleblower program;</li><li>the Department of Homeland Security (DHS) National Cybersecurity Protection System;</li><li>authorities for DHS and the Department of Justice to take certain actions to mitigate a credible threat from an unmanned aircraft system;</li><li>the Temporary Assistance for Needy Families (TANF) program;</li><li>several immigration-related programs and authorities;&nbsp;</li><li>the special assessment on nonindigent persons or entities convicted of certain offenses involving sexual abuse or human trafficking;</li><li>the temporary scheduling order issued by the Drug Enforcement Administration to place fentanyl-related substances in Schedule I of the Controlled Substances Act;</li><li>the authorization for the U.S. Parole Commission; and</li><li>the Department of Agriculture livestock mandatory price reporting program.</li></ul>",
  "latestAction": {
    "actionDate": "2025-03-15",
    "text": "Became Public Law No: 119-4."
  },
  "subjects": [
    "Abortion",
    "Access Board",
    "Accounting and auditing",
    "Administrative law and regulatory procedures",
    "Administrative remedies",
    "Adoption and foster care",
    "Advanced technology and technological innovations",
    "Advisory bodies",
    "Aging",
    "Agricultural conservation and pollution",
    "Agricultural education",
    "Agricultural equipment and machinery",
    "Agricultural insurance",
    "Agricultural marketing and promotion",
    "Agricultural prices, subsidies, credit",
    "Agricultural research",
    "Agricultural trade",
    "Air quality",
    "Alabama"
  ],
  "cosponsors": 0,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1968"
}