{
  "billId": "119-hres-177",
  "congress": 119,
  "type": "HRES",
  "number": "177",
  "title": "Providing for consideration of the joint resolution (H.J. Res. 42) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment\"; providing for consideration of the joint resolution (H.J. Res. 61) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing\"; and providing for consideration of the joint resolution (S.J. Res. 11) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Ocean Energy Management relating to \"Protection of Marine Archaeological Resources\".",
  "summary": "<p>This resolution provides for the House of Representatives to consider the following measures:</p><ul><li>H.J. Res.42, Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to <em>Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment</em>;&nbsp;</li><li>H.J. Res. 61, Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to<em> National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing</em>; and</li><li>S.J. Res. 11, Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Ocean Energy Management relating to <em>Protection of Marine Archaeological Resources</em>.</li></ul><p>Under the resolution, all points of order against consideration of each measure are waived; the measures shall be considered as read; and all points of order against provisions in the measures are waived. The resolution further provides that the previous question shall be considered as ordered on each measure (and any amendment thereto) to final passage without intervening motion except one hour of debate and one motion to recommit.</p>",
  "latestAction": {
    "actionDate": "2025-03-04",
    "actionTime": "14:03:41",
    "text": "Motion to reconsider laid on the table Agreed to without objection."
  },
  "subjects": [
    "House of Representatives",
    "Legislative rules and procedure"
  ],
  "cosponsors": 0,
  "url": "https://www.congress.gov/bill/119th-congress/house-resolution/177"
}