{
  "billId": "119-hr-3838",
  "congress": 119,
  "type": "HR",
  "number": "3838",
  "title": "Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026",
  "summary": "<p><strong>Streamlining Procurement for Effective Execution and Delivery and National Defense Authorization Act for Fiscal Year 2026</strong></p><p>This bill sets forth policies&nbsp;and authorities for FY2026 for Department of Defense (DOD) programs and activities, military construction, and the national security programs of the Department of Energy and the Maritime Administration. It also authorizes appropriations for the Defense Nuclear Facilities Safety Board and the Naval Petroleum Reserves, and modifies the defense acquisition system to expedite delivery of capabilities to the Armed Forces.</p><p>Among other elements, the bill</p><ul><li>authorizes the acquisition or modification of various military items (e.g., aircraft) and sets policy for certain procurement programs;</li><li>authorizes research, development, test, and evaluation and sets policy for such&nbsp;activities;</li><li>sets active component and reserve component end-strength levels;</li><li>sets policy regarding various aspects of military health care and military compensation;</li><li>sets policy regarding acquisitions and acquisition management, including contracting authorities and small businesses;</li><li>sets policy for various matters related to DOD interactions with foreign nations, including matters concerning Israel;</li><li>sets policy for various matters related to DOD cyber activities, cyber workforce and training, cybersecurity, and artificial intelligence matters; and</li><li>authorizes the activities of the National Nuclear Security Administration, defense environmental cleanup, nuclear energy, and other defense activities.</li></ul><p>For additional information on the National Defense Authorization Act (NDAA) see</p><ul><li><a href=\"https://www.congress.gov/crs-product/IF10516\">CRS In Focus IF10516, Defense Primer: Navigating the&nbsp;NDAA</a>, and</li><li><a href=\"https://www.congress.gov/crs-product/IF10515\">CRS In Focus IF10515, Defense Primer: The&nbsp;NDAA Process</a>.</li></ul>",
  "latestAction": {
    "actionDate": "2025-09-30",
    "text": "Received in the Senate."
  },
  "subjects": [
    "Accounting and auditing",
    "Advanced technology and technological innovations",
    "Advisory bodies",
    "Alabama",
    "Alaska",
    "Alliances",
    "Animal protection and human-animal relationships",
    "Appropriations",
    "Arab-Israeli relations",
    "Architecture",
    "Arizona",
    "Arkansas",
    "Armed Forces Retirement Home",
    "Art, artists, authorship",
    "Asia",
    "Assault and harassment offenses",
    "Atmospheric science and weather",
    "Australia",
    "Aviation and airports"
  ],
  "cosponsors": 1,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3838"
}