{
  "billId": "119-hr-1531",
  "congress": 119,
  "type": "HR",
  "number": "1531",
  "title": "PROTECT Taiwan Act",
  "summary": "<p><strong>Pressure Regulatory Organizations To End Chinese Threats to Taiwan Act or the PROTECT Taiwan Act </strong></p><p>This bill requires certain federal entities to seek to exclude China from six international financial organizations if the President informs Congress that China's actions threaten Taiwan and pose a&nbsp;danger to U.S. interests.</p><p>Specifically, the bill establishes that it is U.S. policy to seek to exclude Chinese representatives from participating in the activities of six international organizations if the President informs Congress that China's actions pose any (1) threat to Taiwan's security, economic system, or social system; and (2) danger to U.S. interests.</p><p>The six specified organizations are&nbsp;</p><ul><li>the Group of Twenty,</li><li>the Bank for International Settlements,</li><li>the Financial Stability Board,</li><li>the Basel Committee on Banking Supervision,</li><li>the International Association of Insurance Supervisors, and</li><li>the International Organization of Securities Commissions.</li></ul><p>In the event that the President so informs Congress, the bill requires the Department of the Treasury, the Federal Reserve, and the Securities and Exchange Commission to take all necessary steps to advance the exclusion policy.</p><p>The President may waive the application of this policy to an organization if doing so is in the national interest of the United States.</p>",
  "latestAction": {
    "actionDate": "2026-02-11",
    "text": "Received in the Senate and Read twice and referred to the Committee on Foreign Relations."
  },
  "subjects": [
    "Asia",
    "Banking and financial institutions regulation",
    "China",
    "Foreign and international banking",
    "Presidents and presidential powers, Vice Presidents",
    "Sanctions",
    "Taiwan"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1531"
}