{
  "billId": "119-hr-4371",
  "congress": 119,
  "type": "HR",
  "number": "4371",
  "title": "Kayla Hamilton Act",
  "summary": "<p><strong>Kayla Hamilton Act</strong></p><p>This bill requires the Department of Health and Human Services (HHS) to consider additional information when it makes placement determinations for unaccompanied alien children in its custody. Under federal law, an <em>unaccompanied alien child</em> is a minor with no lawful immigration status and no parent or legal guardian in the United States to provide care and physical custody.</p><p>Current law&nbsp;requires&nbsp;HHS to (1) place a child in the least restrictive setting that is in the child's best interest, and (2) assess the safety and suitability of a sponsor prior to placing a child with that sponsor.&nbsp;</p><p>In determining the least restrictive setting, this bill requires (currently, permits) HHS to consider the child's danger to self, danger to the community, and flight risk. Additionally, the bill requires placement in a secure facility in the case of a child who is 13 years of age or older and has gang-related markings or tattoos or a history of gang-related arrests or criminal conduct.</p><p>In assessing the safety and suitability of a sponsor, this bill requires&nbsp;HHS to collect and provide to the Department of Homeland Security information about all adult residents of the household, including name, date of birth, Social Security number, immigration status, contact information, and the results of all background and criminal records checks. The bill also&nbsp;prohibits HHS from placing a child with a sponsor who is&nbsp;unlawfully present in the United States.&nbsp;</p>",
  "latestAction": {
    "actionDate": "2025-12-17",
    "text": "Received in the Senate."
  },
  "subjects": [
    "Border security and unlawful immigration",
    "Child safety and welfare",
    "Detention of persons",
    "Human trafficking",
    "Immigration status and procedures",
    "Juvenile crime and gang violence",
    "Smuggling and trafficking"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/4371"
}