{
  "billId": "119-hr-2659",
  "congress": 119,
  "type": "HR",
  "number": "2659",
  "title": "Strengthening Cyber Resilience Against State-Sponsored Threats Act",
  "summary": "<p><strong>Strengthening Cyber Resilience Against State-Sponsored Threats Act</strong></p><p>The bill creates a joint interagency task force to facilitate agency collaboration&nbsp;on efforts to respond to&nbsp;Chinese state-sponsored cyber actors, including Volt Typhoon.&nbsp;</p><p>The task force must be established and led by the Cybersecurity and Infrastructure Security Agency (CISA), an agency within the Department of Homeland Security (DHS). The task force must facilitate collaboration and coordination among the Sector Risk Management Agencies&nbsp;(SRMAs) specified in the President's National Security Memorandum- 22 (e.g.,&nbsp;the Department of Defense, the Department of Energy, and the Department of Agriculture) to detect, analyze, and respond to Chinese state-sponsored cyber actors&nbsp;by ensuring that such agencies’ actions are aligned and mutually reinforcing.</p><p>The bill directs&nbsp;DHS, CISA, the Department of Justice, the Federal Bureau of Investigation, and specified SRMAs&nbsp;to provide the task force with analysis, inspections, audits, and other relevant information necessary for&nbsp;the task force to carry out its responsibilities.&nbsp;The production and use of information must comply with all applicable statutes, regulations, and executive orders, and task force members must have appropriate security clearances to access classified information.</p><p>The task force must&nbsp;provide annual reports and briefings to Congress detailing its assessment of cyber threats and recommendations to improve the detection and mitigation of the cybersecurity threat posed by Chinese state-sponsored cyber actors.</p><p>The first report must be provided no later than 540 days after the establishment of the task force, and additional reports must be provided annually thereafter for six years.&nbsp;&nbsp;&nbsp;</p>",
  "latestAction": {
    "actionDate": "2025-11-18",
    "text": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs."
  },
  "subjects": [
    "Asia",
    "China",
    "Computer security and identity theft",
    "Congressional oversight",
    "Federal officials",
    "Government information and archives"
  ],
  "cosponsors": 4,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/2659"
}