{
  "billId": "119-hr-1491",
  "congress": 119,
  "type": "HR",
  "number": "1491",
  "title": "Disaster Related Extension of Deadlines Act",
  "summary": "<p><strong>Disaster Related Extension of Deadlines Act</strong></p><p>This bill requires the Internal Revenue Service (IRS) to treat the postponement of the federal tax return deadline due to a federally declared disaster or certain other events as an extension of such deadline for purposes of calculating the limit on a tax refund. The bill also provides that the IRS’s deadline for sending certain notices includes such postponement.</p><p>Under current law, a tax refund claim must be filed within three years of the date that the federal tax return is filed. (Some exceptions apply.) The tax refund amount generally is limited to federal taxes paid within the three years preceding the tax refund claim plus any extension of the federal tax return deadline (lookback period). The postponement of the federal tax return deadline is not an extension for purposes of the&nbsp;lookback period. (Thus, certain tax payments made before the federal tax return is filed may be excluded from the lookback period.)</p><p>Under the bill, a federal tax return deadline postponed due to a federally declared disaster or certain other events must be treated as an extension of such deadline for purposes of the lookback period.</p><p>Under current law, the IRS is required to mail a notice and demand for tax payment within 60 days of an assessment but not before the tax payment due date.&nbsp;</p><p>The bill provides that the tax payment due date includes the postponement of the tax payment deadline due to a federally declared disaster or certain other events.&nbsp;</p>",
  "latestAction": {
    "actionDate": "2025-12-26",
    "text": "Became Public Law No: 119-64."
  },
  "subjects": [
    "Fires",
    "Forests, forestry, trees",
    "Natural disasters",
    "Tax administration and collection, taxpayers",
    "Terrorism"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1491"
}