{
  "billId": "119-hr-1049",
  "congress": 119,
  "type": "HR",
  "number": "1049",
  "title": "Transparency in Reporting of Adversarial Contributions to Education Act",
  "summary": "<p><strong>Transparency in Reporting of Adversarial Contributions to Education Act</strong></p><p>This bill requires each local educational agency (LEA), as a condition of receiving federal elementary and secondary education funds, to ensure that each elementary and secondary school served by the LEA notifies parents of their rights to request and receive information regarding foreign influence (e.g., influence by China) in schools.</p><p>These rights include the right to</p><ul><li>review (and make copies of at no cost) any curricular or professional development material used at the school that was obtained using funds received from a foreign government or a foreign entity of concern;</li><li>know, by written response, how many school personnel are compensated using funds received from a foreign government or a foreign entity of concern; and</li><li>know, by written response, information about funding from or agreements (e.g., contracts) with a foreign country or a foreign entity of concern.</li></ul><p>Parents must submit a written request for this information.</p><p>Each school must post on a publicly accessible website (or otherwise widely disseminate to the public) a summary notice of parental rights under the bill.&nbsp;</p><p>The bill requires the Department of Education to notify state educational agencies (SEAs) about the bill's requirements. Each SEA must, as a condition of receiving federal elementary and secondary education funds, notify&nbsp;LEAs about the bill's requirements.</p>",
  "latestAction": {
    "actionDate": "2025-12-04",
    "text": "Received in the Senate and Read twice and referred to the Committee on Health, Education, Labor, and Pensions."
  },
  "subjects": [
    "Education programs funding",
    "Elementary and secondary education",
    "School administration",
    "State and local government operations",
    "Teaching, teachers, curricula"
  ],
  "cosponsors": 3,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1049"
}