{
  "billId": "119-hr-3492",
  "congress": 119,
  "type": "HR",
  "number": "3492",
  "title": "Protect Children’s Innocence Act",
  "summary": "<p><strong>Protect Children’s Innocence Act of 2025</strong></p><p>This bill establishes federal criminal offenses for providing gender-affirming care to minors. The bill also changes the existing federal criminal offense that prohibits female genital mutilation (FGM) and related conduct.&nbsp;</p><p>Specifically, the bill makes it a federal crime to knowingly perform or attempt to perform procedures or provide medications (e.g., hormonal treatments) to a minor for the purpose of changing their body to correspond to a sex that differs from their biological sex. The bill provides exceptions for specified types of surgeries or procedures, including those for treating (1) individuals who have both ovarian and testicular tissue or abnormal sex chromosome structure or hormones, or (2) infections or other harms that result from a previous gender-transition procedure. A violation is punishable by a fine, a prison term of up to 10 years, or both. The bill prohibits the arrest or prosecution of an individual who undergoes gender-affirming procedures or medications.&nbsp;</p><p>Additionally, the bill makes changes to the existing federal criminal prohibition on performing FGM on a minor and related conduct. Among the changes, the bill broadens the scope of prohibited conduct to include the facilitation or consent to FGM by any person (currently, prohibited facilitation or consent applies only to a parent, guardian, or caretaker of the minor). The bill also prohibits the arrest or prosecution of an individual who undergoes FGM. The bill does not change the applicable criminal penalty of a fine, a prison term of up to 10 years, or both.&nbsp;</p>",
  "latestAction": {
    "actionDate": "2025-12-18",
    "text": "Received in the Senate and Read twice and referred to the Committee on the Judiciary."
  },
  "subjects": [
    "Child health",
    "Criminal investigation, prosecution, interrogation",
    "Drug therapy",
    "Sex, gender, sexual orientation discrimination",
    "Surgery and anesthesia"
  ],
  "cosponsors": 44,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/3492"
}