{
  "billId": "119-hr-152",
  "congress": 119,
  "type": "HR",
  "number": "152",
  "title": "Federal Disaster Assistance Coordination Act",
  "summary": "<p><strong>Federal Disaster Assistance Coordination Act</strong></p><p>This bill requires the Federal Emergency Management Agency (FEMA) to streamline disaster information collection, convene a working group on preliminary damage assessments, and provide a report to Congress.</p><p>FEMA must (1) conduct a study and develop a plan under which the collection of information from disaster assistance applicants and grantees will be made less burdensome, duplicative, and time consuming for applicants and grantees; and (2) develop a plan for the regular collection and reporting of information on federal disaster assistance awarded.</p><p>Additionally, not later than two years after enactment of the bill, FEMA must convene a working group on a regular basis to (1) identify potential areas of duplication or fragmentation in preliminary damage assessments after disaster declarations; (2)&nbsp;determine the applicability of having one federal agency make the assessments for all agencies; and (3) identify potential emerging technologies, such as unmanned aircraft systems (i.e., drones), to expedite the administration of preliminary damage assessments.</p><p>FEMA must submit a comprehensive report on the plans for streamlining and consolidating information collection and the findings and recommendations of the working group to Congress with a briefing. The report must be made available to the public and posted on FEMA's website.</p>",
  "latestAction": {
    "actionDate": "2025-01-14",
    "text": "Received in the Senate and Read twice and referred to the Committee on Homeland Security and Governmental Affairs."
  },
  "subjects": [
    "Congressional oversight",
    "Disaster relief and insurance",
    "Government information and archives",
    "Government studies and investigations"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/152"
}