{
  "billId": "119-hr-4090",
  "congress": 119,
  "type": "HR",
  "number": "4090",
  "title": "Critical Mineral Dominance Act",
  "summary": "<p><strong>Critical Mineral Dominance Act</strong></p><p>This bill directs the Department of the Interior to address mineral supply chain vulnerabilities, including by accelerating and expanding mineral production on federal land (i.e., National Forest System land, public lands, and any land that may be leased for the exploration, development, or production of hardrock minerals).</p><p>Interior must (1) identify&nbsp;priority mining projects on federal lands that can be immediately approved, and (2) take all necessary and appropriate steps to expedite those projects.</p><p>Interior must also identify active, inactive, or proposed mining projects on federal land that have the potential to (1) increase production of&nbsp;hardrock minerals or their byproducts, (2) expand existing operations to include such byproducts, or (3) produce hardrock minerals from mine tailings or&nbsp;coal byproducts.&nbsp;</p><p>Further, Interior must identify certain federal land with potential for&nbsp;hardrock mining. Interior must prioritize identifying land where a mining project (1) can most quickly be fully permitted and operational, and (2) would have the greatest potential effect on the robustness of the domestic mineral supply chain.</p><p> Interior must (1) suspend, revise, or rescind agency actions that place undue burdens on mining projects; (2) recommend changes to current law necessary to expand U.S. production of hardrock minerals; and (3) review state and local laws that impede development of domestic mining and mineral exploration projects.</p><p>Interior must also report on the dollar value and overall economic impact of the United States' reliance on imports of certain mineral commodities.</p><p>Finally, Interior must prioritize efforts to accelerate geologic mapping.</p>",
  "latestAction": {
    "actionDate": "2026-02-05",
    "text": "Received in the Senate and Read twice and referred to the Committee on Energy and Natural Resources."
  },
  "subjects": [
    "Competitiveness, trade promotion, trade deficits",
    "Economic performance and conditions",
    "Geography and mapping",
    "Government studies and investigations",
    "Metals",
    "Mining"
  ],
  "cosponsors": 2,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/4090"
}