{
  "billId": "119-hr-1048",
  "congress": 119,
  "type": "HR",
  "number": "1048",
  "title": "DETERRENT Act",
  "summary": "<p><strong>Defending Education Transparency and Ending Rogue Regimes Engaging in Nefarious Transactions Act or the DETERRENT Act</strong></p><p>This bill expands oversight and disclosure requirements related to foreign sources and institutions of higher education (IHEs).</p><p>Specifically, the bill requires an IHE to annually disclose to the Department of Education (ED) any year in which the IHE</p><ul><li>receives a gift from a foreign country of concern (e.g., China or Russia) or foreign entity of concern of any dollar amount;</li><li>receives a gift or contract from a foreign source (other than a foreign country of concern or foreign entity of concern) that is valued at $50,000 or more, considered alone or in combination with all other gifts or contracts within a calendar year (current disclosure threshold is $250,000 or more), or which has an undetermined monetary value;</li><li>enters into a contract with a foreign country of concern or foreign entity of concern after receiving a waiver for such contract; or</li><li>is substantially controlled by a foreign source.</li></ul><p>Additionally, the bill</p><ul><li>prohibits IHEs from entering into contracts with a foreign country of concern or with a foreign entity of concern without obtaining a waiver,</li><li>requires certain IHEs to disclose gifts or contracts between covered individuals (e.g., researchers) and foreign sources, and</li><li>requires private IHEs with specified assets or investments to file annual investment disclosure reports.</li></ul><p>The bill requires ED to investigate possible violations of this bill and outlines the various penalties for each violation. Penalties may include losing eligibility for federal student financial aid.</p>",
  "latestAction": {
    "actionDate": "2025-03-31",
    "text": "Received in the Senate and Read twice and referred to the Committee on Health, Education, Labor, and Pensions."
  },
  "subjects": [
    "Civil actions and liability",
    "Congressional oversight",
    "Contracts and agency",
    "Education programs funding",
    "Financial services and investments",
    "Government information and archives",
    "Government studies and investigations",
    "Higher education",
    "Subversive activities",
    "Teaching, teachers, curricula"
  ],
  "cosponsors": 21,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/1048"
}