{
  "billId": "119-hres-5",
  "congress": 119,
  "type": "HRES",
  "number": "5",
  "title": "Adopting the Rules of the House of Representatives for the One Hundred Nineteenth Congress, and for other purposes.",
  "summary": "<p>This resolution establishes rules for the House of Representatives for the 119th Congress.</p><p>The resolution adopts the rules from the 118th Congress with specified changes, including</p><ul><li>providing that a resolution vacating the Office of Speaker is only privileged (takes precedence over all matters other than motions to adjourn) if it is offered by a sponsor of the majority party joined by eight cosponsors from the majority party;&nbsp;</li><li>providing that the Speaker may only entertain a motion to suspend the rules on Mondays, Tuesdays, and Wednesdays; </li><li>prohibiting&nbsp;waiver (by rule or by order) of the germaneness rule (which requires amendments to be of the same subject matter as the measure under consideration); and </li><li>prohibiting consideration of measures that exceed a specified long-term budget impact according to the Congressional Budget Office.</li></ul><p>Additional changes include</p><ul><li>authorizing the use of electronic voting within a committee;</li><li>authorizing remote appearances by&nbsp;non-executive branch witnesses and their counsel in committee proceedings;&nbsp;</li><li>eliminating the House Office of Diversity and Inclusion;&nbsp;</li><li>eliminating&nbsp;certain collective bargaining rights for employees of the House of Representatives; </li><li>reauthorizing the House Select Committee on the Strategic Competition Between the United States and the Chinese Communist Party;&nbsp;</li><li>reauthorizing the Tom Lantos Human Rights Commission; and&nbsp;</li><li>reauthorizing the House Democracy Assistance Commission&nbsp;(an entity that advises democratic parliaments in other countries)&nbsp;and renaming it the House Democracy Partnership. </li></ul><p>The resolution provides for the consideration of H.R. 21, H.R. 22, H.R. 23, H.R. 26, H.R. 27, H.R. 28, H.R. 29, H.R. 30, H.R. 31, H.R. 32, H.R. 33, and H.R. 35.</p>",
  "latestAction": {
    "actionDate": "2025-01-03",
    "actionTime": "18:12:02",
    "text": "Motion to reconsider laid on the table Agreed to without objection."
  },
  "subjects": [
    "Abortion",
    "Administrative law and regulatory procedures",
    "Advanced technology and technological innovations",
    "Appropriations",
    "Asia",
    "Assault and harassment offenses",
    "Border security and unlawful immigration",
    "Budget deficits and national debt",
    "Budget process",
    "China",
    "Computers and information technology",
    "Congressional Budget Office (CBO)",
    "Congressional committees",
    "Congressional leadership",
    "Congressional officers and employees",
    "Congressional operations and organization",
    "Congressional oversight",
    "Crimes against property",
    "Domestic violence and child abuse"
  ],
  "cosponsors": 0,
  "url": "https://www.congress.gov/bill/119th-congress/house-resolution/5"
}