{
  "billId": "119-hr-6500",
  "congress": 119,
  "type": "HR",
  "number": "6500",
  "title": "AGOA Extension Act",
  "summary": "<p><strong>AGOA Extension Act</strong></p><p>This bill extends through December 31, 2028, trade preferences that provide duty-free access to the U.S. market for most exports from eligible countries in sub-Saharan Africa (SSA). The bill also extends through December 31, 2031, customs user fees and merchandise processing fees.</p><p>Specifically, the bill extends through 2028 the duty-free treatment of the products of beneficiary&nbsp;SSA&nbsp;countries under the Trade Act of 1974 (specifically, the Generalized System of Preferences) and the African Growth and Opportunity Act (AGOA). (Currently, there are 32&nbsp;countries eligible for AGOA.)</p><p>Additionally, the extended period applies to the following provisions of AGOA: (1) the duty-free treatment of certain apparel articles from beneficiary SSA countries; and (2) the third-country fabric provision, which allows limited amounts of apparel articles from lesser developed beneficiary&nbsp;SSA countries to qualify for duty-free treatment, even if the yarns and fabrics used in their production are imported from non-AGOA countries (e.g., apparel assembled in Kenya with Chinese fabrics).</p><p>The bill also provides for the refund of duties (i.e., liquidation or reliquidation of entries) on articles from eligible&nbsp;SSA countries that entered into the United States after September 30, 2025, and before the date of this bill's enactment. A refund request must be filed with U.S. Customs and Border Protection (CBP) and must contain sufficient information for CBP to locate the entry or, if the entry cannot be located, reconstruct the entry. CBP must refund any duties previously paid with respect to the entry within 90 days.</p>",
  "latestAction": {
    "actionDate": "2026-02-10",
    "text": "Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 320."
  },
  "subjects": [
    "Africa",
    "Competitiveness, trade promotion, trade deficits",
    "Customs enforcement",
    "Normal trade relations, most-favored-nation treatment",
    "User charges and fees"
  ],
  "cosponsors": 1,
  "url": "https://www.congress.gov/bill/119th-congress/house-bill/6500"
}