{
  "abortion": {
    "summary": "Mixed and inconsistent record on abortion-related policy: cast both Yea and Nay on the Supporting Pregnant and Parenting Women and Families Act (which would allow TANF funds to be used for pregnancy centers that promote protecting the life of the unborn), indicating an unclear or split stance on directing welfare funds to pregnancy centers tied to anti-abortion positions. Also registered both Yea and Nay votes on the Pregnant Students' Rights Act (which would require institutions of higher education to provide information and resources to students who choose to carry a pregnancy to term), further demonstrating inconsistent positions on measures that mandate institutional supports or information for pregnant students and on reproductive-related student accommodations. Most recently voted No on the rule (H.Res.1009) that would have allowed consideration of H.R.6945 (clarifying State authority to use funds for pregnancy centers), signaling opposition to advancing that specific bill and adding an instance of opposing the use of TANF for pregnancy-center funding.",
    "evidence": 6
  },
  "budget_economy": {
    "summary": "Voted Nay on the FY2025 congressional budget resolution (H.Con.Res.14) in two separate roll calls, opposing the specific congressional budget blueprint and its reconciliation instructions that would have allowed large deficit increases and changes to the statutory debt limit. This adds to a mixed record on federal spending and appropriations: the member has supported some omnibus/CR funding vehicles (e.g., Consolidated Appropriations Act, 2026; H.R.5371) while opposing other appropriations and specific funding measures, and has cast both Yea and Nay on major reconciliation and defense appropriations — indicating selective support for particular funding vehicles and reservations about budgetary plans that permit large reconciliation-driven deficit increases. Most recently in this batch the member voted Yea on the Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropriations Act, 2026 (H.R.6938), signaling support for this FY2026 appropriations package that funds Commerce, DOJ, NASA, NSF, DOE, DOI, EPA, the Forest Service, Army Corps civil works, and related programs—further demonstrating willingness to back specific appropriations bills that advance science, energy/water, interior/environment, and justice-related funding.",
    "evidence": 27
  },
  "civil_rights": {
    "summary": "Split and inconsistent record on voting-access and disability oversight: has cast both Yea and Nay on provisions related to VA accessibility advisory committee changes, voted Nay on the CLEAN DC Act (opposing repeal of D.C. policing reforms), and has split votes on the SAVE Act (documentary proof-of-citizenship for federal voter registration), indicating an inconsistent stance on imposing stricter documentation requirements for voter registration versus preserving broader access. The member supported tribal land and sacred-site protections (voted Yea on the Wounded Knee Massacre Memorial and Sacred Site Act). On the question of gender-affirming care for minors the member has a conflicting record: in earlier batches voted Nay on the Protect Children's Innocence Act (opposing a federal criminal prohibition) but in later batches cast a Yea on that same bill — and in the current batch registered both a Yea and a Nay on the Do No Harm in Medicaid Act (which would prohibit federal Medicaid payment for gender-transition procedures for individuals under 18) — demonstrating repeated both-Yea-and-Nay voting and an inconsistent or evolving position on federal limits or prohibitions targeting gender-affirming care for youth. In the latest batch the member also cast both Yea and Nay on H.Res.5 (House rules), which included eliminating the House Office of Diversity and Inclusion—this mixed voting on a rule that removes an institutional diversity office further indicates an inconsistent or fluctuating position on congressional diversity/equity institutionalization. Additionally, the member voted Nay on the District of Columbia Policing Protection Act of 2025 (which would have repealed DC's vehicular-pursuit restrictions and required more aggressive pursuit rules), reinforcing a pattern of opposing efforts to roll back DC policing reforms and supporting retention of stronger pursuit limitations. In the current batch the member also voted Yea on H.R.6938 (the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026), supporting DOJ and related funding for law-enforcement and justice-related activities—indicating willingness to back appropriations that sustain federal justice and civil-rights enforcement capacities.",
    "evidence": 20
  },
  "corporations": {
    "summary": "Mixed and inconsistent record on corporate-governance and fiduciary-rule issues: registered both Yea and Nay on the Protecting Prudent Investment of Retirement Savings Act (HR-2988), which would require retirement-plan fiduciaries to base decisions on pecuniary factors, constrain consideration of nonpecuniary (e.g., ESG) factors, and set rules for exercise of shareholder rights/proxy voting—indicating a split stance on limiting fiduciary consideration of ESG/nonpecuniary issues and on rules governing plan fiduciaries' proxy-voting duties.",
    "evidence": 2
  },
  "crime": {
    "summary": "Voted Nay on the CLEAN DC Act, opposing repeal of the District's 2022 policing reforms; this indicates support for maintaining measures aimed at policing accountability and restrictions on certain uses of force. Also voted Nay on the Stop Illegal Entry Act of 2025, opposing stronger mandatory-minimum and expanded criminal penalties for illegal entry and illegal reentry, which signals resistance to further criminalizing migration-related conduct. More recently voted Nay on the District of Columbia Policing Protection Act of 2025 (opposing repeal of DC's vehicular-pursuit restrictions), further underscoring support for preserving policing-reform constraints on pursuits and prioritizing public-safety risk mitigation. In the newest batch the member opposed lowering the age to try minors as adults to 14 in D.C. (voted Nay on HR-5140), signaling support for juvenile protections and rehabilitation-oriented approaches to youth offending, but also voted Yea on the D.C. CRIMES Act (HR-4922), supporting limits on D.C.'s authority over sentencing and a stricter default sentencing for youth offenders — producing a mixed record that balances opposition to some punitive measures with occasional support for tougher sentencing or federal intervention in D.C. sentencing rules. The member voted Yea on the HALT Fentanyl Act to permanently place fentanyl-related substances into Schedule I and impose severe mandatory-minimum penalties for fentanyl offenses, indicating a willingness to support stringent criminal penalties and expanded drug-scheduling to address fentanyl trafficking—highlighting a contrast between resisting expanded criminal penalties for migration while supporting tough drug penalties. In the current batch the member voted Yea on H.R.6938 (the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026), indicating support for FY2026 DOJ and related law-enforcement funding—demonstrating willingness to fund federal justice programs alongside a selective approach to criminal-justice policy.",
    "evidence": 9
  },
  "drugs": {
    "summary": "Voted Yea on the HALT Fentanyl Act, supporting permanent class-wide Schedule I classification for fentanyl-related substances, adoption of the same quantity thresholds and mandatory-minimum penalties as for fentanyl analogues, and related research-registration changes—indicating support for strict scheduling and severe criminal penalties aimed at curbing fentanyl trafficking while also accommodating certain research-authority adjustments.",
    "evidence": 1
  },
  "education": {
    "summary": "Voted Yea on the ANCHOR Act to require the National Science Foundation to develop a plan to improve cybersecurity and telecommunications capabilities for the U.S. Academic Research Fleet, indicating support for federal investment in research infrastructure, connectivity, and protections that benefit students, educators, and oceanographic research operations. In the current batch the member cast both Yea and Nay on the Pregnant Students' Rights Act (which would require institutions of higher education to provide information, resources, and accommodation details to students who choose to carry a pregnancy to term), demonstrating an inconsistent position on mandating institutional notice and support for pregnant students. Most recently the member voted Yea on H.R.6938 (the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026), supporting FY2026 funding for NSF, NASA, and related research and science education programs—indicating continued backing for federal science and research investments that support higher education and STEM capacity. The member also voted No on the rule (H.Res.1009) that would have allowed consideration of H.R.6359 (the Pregnant Students' Rights Act), signaling opposition to advancing that specific mandate and adding another instance of not supporting that federal requirement.",
    "evidence": 8
  },
  "energy_oil": {
    "summary": "Mixed record on energy and natural resources: voted Yea on the Energy and Water Development and Related Agencies Appropriations Act, 2026 (HR-4553), signaling support for DOE and water infrastructure funding, and voted Yea on the Mining Regulatory Clarity Act (HR-1366), indicating support for expanded mining ancillary-use rights and the Abandoned Hardrock Mine Fund. More recently registered split votes on the Critical Mineral Dominance Act (both Yea and Nay), showing an inconsistent position on accelerating and expanding hardrock mining on federal lands to bolster mineral supply chains. In this batch cast Nay on the REFINER Act (opposing a directed DOE/National Petroleum Council study to identify opportunities to expand petrochemical/refinery capacity) and Nay on the Unlocking our Domestic LNG Potential Act of 2025 (opposing removing DOE review and making it easier to site/approve LNG export/import facilities), which suggests reluctance to back legislative measures that would explicitly accelerate refinery capacity or deregulate LNG exports—indicating a selective approach that supports some energy infrastructure funding but resists other fossil-fuel expansion/deregulation steps. In this batch also voted Nay on two joint resolutions (SJRES-80 and HJRES-130) that would have nullified BLM actions limiting oil/gas leasing in the National Petroleum Reserve-Alaska and making federal coal unavailable for leasing in the Buffalo Field Office, signaling opposition to rolling back federal restrictions on fossil-fuel leasing and a tendency to support maintaining leasing limits on public lands. Additionally voted Nay on HJRES-131, HJRES-104, and HJRES-106 (opposing congressional attempts to nullify BLM rules that limited leasing or designated areas unavailable for oil, gas, and coal leasing in the Coastal Plain/ANWR, Miles City, and Central Yukon), reinforcing a pattern of supporting BLM protections and constraints on fossil-fuel leasing on federal lands. In this batch also voted Nay on HJRES-105 (opposing a congressional effort to nullify the BLM North Dakota RMP), further indicating support for maintaining BLM-imposed limits on oil, gas and coal development in that field office. Most recently voted Nay on the GRID Power Act (opposing a FERC-directed prioritization of interconnection for 'dispatchable' projects), suggesting reluctance to adopt regulatory changes that would fast-track prioritization of dispatchable generation in interconnection queues. Also voted Nay on the Electric Supply Chain Act, opposing a DOE-directed periodic assessment/report on electricity generation and transmission supply chain vulnerabilities and recommendations on critical-mineral processing and related barriers — a vote that indicates reluctance to back a new DOE reporting/assessment mandate focused on securing electricity supply chains. In this batch voted Nay on the Reliable Power Act (opposing giving FERC additional pre-finalization review authority over federal regulations when NERC determines the bulk-power system faces generation inadequacy) and Nay on the State Planning for Reliability and Affordability Act (opposing a requirement that state integrated resource plans mandate fuel-secure 'reliable generation' characteristics), reinforcing a pattern of opposing measures that would create new federal or state mandates prioritizing fuel-secure/dispatchable generation or add extra regulatory review steps focused on reliability. Additionally, the member voted Nay on H.J.Res.42 (oposing congressional disapproval of a DOE appliance-efficiency/certification/labeling rule), which indicates support for DOE's updated energy-conservation/certification and enforcement provisions affecting consumer and commercial products. In this batch the member also cast both Yea and Nay on the Power Plant Reliability Act of 2025 (which would allow FERC to order power plants to remain open for up to five years, require multi-year notice of planned retirements, establish cost recovery and allocation rules, and exempt actions taken to comply with such orders from federal, state, and local environmental laws). The split votes on that bill reinforce an inconsistent approach to balancing grid reliability, cost-recovery mechanisms, and environmental-exemption provisions. In the current batch the member was Not Voting on H.J.Res.140, a joint resolution that would have nullified a BLM withdrawal protecting roughly 225,504 acres in northern Minnesota (including areas near the Boundary Waters) and allowed mineral and geothermal leasing there—a abstention that leaves the member's stance on that specific rollback of public-land protections unclear. In the current batch the member voted Yea on H.R.6938, the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026, indicating support for FY2026 Energy and Water/DOE funding and related water and energy development programs contained in that appropriations package. In the most recent votes the member registered both Yea and Nay on the SHOWER Act (HR-4593), which would statutorily adopt a revised DOE definition for showerheads and require DOE to revise related water/efficiency regulations—demonstrating an inconsistent stance toward legislation that would alter DOE appliance/water-efficiency regulatory definitions and rescind or replace prior DOE regulatory definitions. Most recently voted Nay on the Affordable HOMES Act (HR-5184), opposing rescission of DOE energy-efficiency regulations for manufactured housing and indicating support for maintaining DOE authority and federal efficiency standards for manufactured homes.",
    "evidence": 34
  },
  "environment": {
    "summary": "Mixed stance on public lands and resource development: voted Yea on the Wabeno Economic Development Act to convey federal land for local economic use and require permitting reviews for stone/sand/gravel; voted Yea on the Mining Regulatory Clarity Act (HR-1366) supporting expanded ancillary-use rights for mining operators; and voted Yea on the Energy and Water Development appropriations (HR-4553). Also cast both Yea and Nay on the Critical Mineral Dominance Act, indicating an inconsistent or selective approach to balancing resource development and environmental protections on federal lands. In this batch, voted Nay on the REFINER Act and Nay on the Unlocking our Domestic LNG Potential Act, reflecting reluctance to endorse congressional steps that would directly promote refinery capacity expansion or ease LNG export/import approvals—reflecting some restraint on measures that would expand fossil-fuel infrastructure despite other pro-development votes. Also in this batch the member voted Nay on SJRES-80 and HJRES-130 (opposing congressional disapproval of BLM rules that limited oil/gas leasing in the National Petroleum Reserve-Alaska and that removed coal leasing availability in the Buffalo Field Office), which indicates support for maintaining BLM protections and constraints on fossil-fuel leasing on federal public lands. The member further voted Nay on HJRES-131, HJRES-104, and HJRES-106, opposing attempts to nullify BLM decisions that protected parts of the Coastal Plain/ANWR, removed coal leasing consideration in the Miles City area, and designated large areas in the Central Yukon as conservation or research areas—strengthening the pattern of supporting conservation designations and leasing limits on public lands. In this batch voted Nay on HJRES-105 (opposing nullification of the North Dakota BLM RMP) and registered both a Nay and a Yea on HR-845 (the Pet and Livestock Protection Act, which would remove gray wolf protections under the ESA), showing a split, inconsistent set of votes on endangered species protections and reinforcing an overall mixed but conservation-leaning approach to public-land and wildlife policy. Recently voted Yea on the Make SWAPs Efficient Act, supporting expedited Interior approval of State Wildlife Action Plans and guaranteeing set-aside funding if Interior misses the deadline, which signals backing for state-level wildlife conservation funding and procedural fixes to speed conservation projects. Also voted Nay on the Fix Our Forests Act, opposing provisions that would exempt certain forest projects from NEPA review, limit consultations under the Endangered Species Act, and constrain litigation remedies—indicating a preference for maintaining environmental review and species-protection safeguards even while supporting targeted conservation funding and wildfire risk reduction efforts. Also voted Yea to convey a small parcel of Forest Service land to Perry County for public uses (education and youth development) and voted Yea to expand the Miccosukee Reserved Area in Everglades National Park, signaling support for targeted local land conveyances, tribal reserved-area protections, and DOI consultation/actions to protect structures from flooding. Supported tribal sacred-site protections (voted Yea on the Wounded Knee Massacre Memorial and Sacred Site Act) and voted Yea on H.R.5371 (the continuing resolution) which included wildfire/wildland fire management and Forest Service authorities—both votes reinforce a pattern of supporting tribal protections, conservation designations, and wildfire funding while remaining selective on resource development measures. Most recently registered both a Yea and a Nay on the FY2025 reconciliation package (H.R.1) in this batch  — which included rescissions of certain Inflation Reduction Act conservation funds (ACEP, EQIP, CSP, RCPP) — producing a split record on whether to preserve or alter IRA-funded conservation investments and reflecting an inconsistent position on that major conservation-related reconciliation provision. The member also voted Nay on multiple roll calls on other FY2026 appropriations vehicles in prior batches. The member also opposed congressional disapproval of a DOE appliance-efficiency/certification/labeling rule (voted Nay on H.J.Res.42), indicating support for federal appliance-efficiency standards and enforcement that can reduce energy use and emissions. In this batch the member cast both Yea and Nay on the Power Plant Reliability Act of 2025, which would have exempted actions taken to comply with FERC orders from environmental laws; those split votes underscore an inconsistent balance between protecting environmental review and supporting emergency reliability measures. In the current batch the member was Not Voting on H.J.Res.140, the joint resolution to nullify a BLM withdrawal protecting roughly 225,504 acres in Cook, Lake, and Saint Louis Counties, Minnesota (areas near the Boundary Waters), an abstention that leaves the member's stance on that specific rollback of public-land protections unclear. In the current batch the member voted Nay on the National Coal Council Reestablishment Act (opposing reestablishing a statutory coal-industry advisory council at DOE) and Nay on the Promoting Cross-border Energy Infrastructure Act (opposing the new expedited certification/permit process for cross-border oil, natural gas, and electric transmission facilities), reinforcing a pattern of reluctance to advance new federal mechanisms that would explicitly promote coal-industry influence or streamline cross-border fossil-fuel infrastructure. Voted Yea on the Finish the Arkansas Valley Conduit Act to reduce community repayment burdens, remove interest payments, and extend repayment periods for a Bureau of Reclamation water pipeline project, indicating support for federal measures to lower local costs and advance water infrastructure affordability and delivery for affected communities. Most recently the member voted Yea on H.R.6938 (the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026), showing support for FY2026 funding for DOI, EPA, Forest Service, and Army Corps civil-works programs—reinforcing a pattern of backing annual appropriations that fund public-lands and environmental programs while remaining selective on specific resource-development measures. The member also voted No on the rule (H.Res.1009) that would have allowed consideration of H.J.Res.140 (the joint resolution to disapprove the BLM withdrawal for lands in northern Minnesota), signaling opposition to advancing that disapproval and reinforcing support for maintaining the BLM withdrawal and protections for those public lands. In the current batch the member voted Nay on the SPEED Act (HR-4776), opposing statutory limits on NEPA and actions that would narrow environmental review thresholds, but in a later roll call in this batch voted Yea on the SPEED Act, supporting statutory limits on NEPA review and expedited permitting—producing a split record on NEPA-limiting measures and reinforcing an inconsistent stance on whether to constrain or preserve broad NEPA review and judicial review for federal actions. Also voted Nay on the Affordable HOMES Act (HR-5184), opposing rescission of DOE energy-efficiency regulations for manufactured housing and indicating support for maintaining DOE authority and federal appliance-efficiency standards affecting manufactured housing.",
    "evidence": 50
  },
  "families_children": {
    "summary": "Has supported local measures benefiting families (opposed nullifying D.C.'s tax changes that restored a child tax credit) and voted Yea on the Housing for the 21st Century Act. However, cast both Yea and Nay on the Supporting Pregnant and Parenting Women and Families Act (which would permit TANF funds for pregnancy centers), showing inconsistent positions on funding family services when those services are tied to pregnancy-center/anti-abortion policy. Also voted Yea to permit conveyance of a small parcel of Forest Service land to Perry County for public purposes including education and youth development, indicating support for local investments that benefit children and families. The member's record on gender-affirming care for minors is inconsistent: earlier batches included a Nay on the Protect Children's Innocence Act (opposing federal criminalization), later recorded a Yea on that same bill, and in the current batch the member registered both a Yea and a Nay on the Do No Harm in Medicaid Act (which would prohibit federal Medicaid payment for gender-transition procedures for individuals under 18) — demonstrating conflicting votes on whether to restrict or prohibit gender-affirming care for youth and on whether Medicaid should cover such care. On unaccompanied alien children placement policy the member also registered split votes in the latest batch (both Yea and Nay on the Kayla Hamilton Act), showing inconsistent positions on requiring expanded sponsor/background information, prohibiting placement with unlawfully present sponsors, and mandating secure placements for certain older minors with gang-related indicators. Most recently registered both a Yea and a Nay on the FY2025 reconciliation package (H.R.1), which included significant SNAP changes and work-requirement expansions — indicating the member's position on major nutrition supports affecting families and children is mixed and issue-by-issue rather than uniformly supportive or oppositional. In this batch the member voted Yea on H.R.5371 (the FY2026 continuing-appropriations act), which extended Head Start and other child- and family-related program authorities through the CR period, and voted Nay on the Protect Children’s Innocence Act in earlier roll calls, indicating support for certain child- and family-focused program extensions and a conflicted record on criminalizing gender-affirming medical care for youth. The member also voted Nay on multiple roll calls on other continuing-appropriations packages in prior batches. In the most recent batch the member cast both Yea and Nay on the Pregnant Students' Rights Act (which would require IHEs to provide resources and accommodation information to students who choose to carry pregnancies to term), further demonstrating inconsistent positions on federal measures to mandate institutional supports and information for pregnant students. In the current batch the member voted Yea on the Empowering Employer Child and Elder Care Solutions Act (HR-2270), supporting exclusion of the value of employer-funded child or dependent care from overtime-rate calculations—indicating willingness to back employer-provided care benefits even where they alter overtime-pay computations and reflecting a selective approach to supporting family-related policy tied to employer benefits.",
    "evidence": 22
  },
  "foreign_policy": {
    "summary": "Voted Yea on the PROTECT Taiwan Act (HR-1531), supporting a policy to press for excluding Chinese representatives from certain international financial organizations if the President determines China's actions threaten Taiwan — indicating a hawkish stance favoring use of financial/institutional pressure on China to defend Taiwan and U.S. interests. Also voted Yea on the AGOA Extension Act (HR-6500), supporting continuation of U.S. trade preferences for sub-Saharan African countries, and voted Yea on the Financial Services and General Government and National Security, Department of State, and Related Programs Appropriations Act, 2026 (HR-7006), indicating support for continued funding of the Department of State and foreign assistance programs. At the same time, the member has registered split votes on major defense funding—casting both Nay and Yea on the Department of Defense Appropriations Act, 2026—suggesting an inconsistent approach to defense spending and military funding despite earlier hawkish foreign-policy positions. In the most recent votes the member voted Yea on H.R.5371, which extended authorities for the U.S. International Development Finance Corporation and various foreign-assistance authorizations through the CR, but the member also voted Nay on multiple roll calls on some other continuing-appropriations packages, indicating a selective approach to continuing foreign assistance and international finance authorizations. Additionally, voted Yea on the No New Burma Funds Act (HR-4423) to press for continued pause on World Bank disbursements to Burma following the 2021 military coup, indicating willingness to use multilateral-financial levers to pressure abusive regimes. The member also voted Yea on the Made-in-America Defense Act (H.R.4216) to require an annual State Department review of the FMS-only list to identify items eligible for Direct Commercial Sales, reflecting support for streamlining defense exports and enhancing U.S. defense industrial competitiveness through expanded direct commercial sales options. In the current batch the member also voted Yea on the Strengthening Cyber Resilience Against State-Sponsored Threats Act to establish a CISA-led interagency task force focused on detecting and responding to Chinese state-sponsored cyber actors, showing support for using coordinated interagency cyber tools and reporting to Congress to counter Chinese cyber threats. The member also registered both Yea and Nay votes on the FY2026 NDAA/procurement vehicle (HR-3838), reinforcing a mixed record on defense authorization and procurement policies that affect U.S. security posture and foreign engagements. Most recently the member voted Yea on the National Defense Authorization Act for Fiscal Year 2026 (S.1071) in two roll calls, indicating willingness to support FY2026 DOD policies and authorities, including procurement, personnel levels, acquisitions, and defense cyber/AI-related policy provisions. The member also voted Yea on the Remote Access Security Act (HR-2683), supporting an expansion of export controls to cover remote access to U.S.-jurisdiction items, which signals support for using export-control authorities to limit foreign access to sensitive dual-use and defense-related technologies delivered or accessed remotely.",
    "evidence": 22
  },
  "free_trade": {
    "summary": "Voted Yea on the AGOA Extension Act (HR-6500), supporting extension of duty-free market access and apparel provisions for eligible sub-Saharan African countries—signaling support for targeted trade preferences to promote exports and economic ties with developing countries. More recently was Not Voting on the Haiti Economic Lift Program Extension Act (HR-6504), an abstention on extending duty-free apparel preferences for Haiti, indicating at least some support for preferential trade programs but an unclear or absent position on the Haiti-specific renewal.",
    "evidence": 2
  },
  "government_reform": {
    "summary": "Mixed record on administrative oversight and election policy: split votes on the Veterans Accessibility Advisory Committee Act (both supporting and opposing different advisory/abolishment provisions) and split votes on the SAVE Act (documentary proof-of-citizenship for federal voter registration), indicating an inconsistent approach to creating new advisory oversight while also supporting stricter documentation requirements for voter registration in some instances. Voted Aye on the Epstein Files Transparency Act in this batch, showing explicit support for requiring DOJ to publish unclassified records and report to Congress on redactions and named officials in a high-profile investigation—demonstrating a clear interest in transparency and accountability in law enforcement oversight. Recently voted Nay on the DUMP Red Tape Act, opposing a statutory requirement for the SBA Office of Advocacy to maintain a Red Tape Hotline and annually report to Congress, which suggests reluctance to create new mandated reporting mechanisms for regulatory burden on small businesses. In the latest batch the member cast both Yea and Nay votes on H.Res.5 (the House rules package for the 119th Congress), which contained multiple House governance changes (limits on motion-to-vacate privilege, limits on suspensions, germaneness waiver prohibition, authorizing electronic voting in committee, allowing remote appearances by non-executive-branch witnesses, eliminating the House Office of Diversity and Inclusion, and removing certain collective bargaining rights for House employees). The mixed votes on this rules package reinforce an inconsistent or selective approach to procedural and institutional House governance reforms. The member also voted Yea on HR-4058 (the Enhancing Stakeholder Support and Outreach for Preparedness Grants Act), which requires FEMA outreach, technical assistance, annual stakeholder surveys, and GAO reporting on implementation—indicating support for oversight, stakeholder engagement, and formal reporting requirements for federal grant programs. In the current batch voted Yea on the Personnel Oversight and Shift Tracking Act (POST Act), supporting mandated FPS performance testing, corrective-training plans, tracking-system assessment or upgrades, and required reporting to Congress on implementation and annual follow-ups—demonstrating support for increased operational oversight, performance standards, and congressional reporting requirements for contract security protecting federal buildings. The member also voted Yea on the SPACE Act of 2025 (HR-3424) to direct GSA to collaborate with tenant agencies to expand shared-space arrangements in federally leased buildings and establish measurable objectives, indicating support for administrative efficiency and modernizing federal property management. In the most recent D.C.-focused votes the member supported the D.C. CRIMES Act (HR-4922), which would limit D.C.'s authority over criminal sentencing and reduce the youth-offender maximum age, but opposed terminating the D.C. Judicial Nomination Commission (voted Nay on HR-5125), reflecting a selective approach to federal intervention in D.C. governance—willing to back federal constraints on local sentencing in some cases while defending local judicial-selection structures in others. Also voted Yea on the Mail Traffic Deaths Reporting Act to require USPS to collect, track, and publicly report data on mail-vehicle crashes that result in injury or death, and voted Yea on the Consumer Safety Technology Act, which mandates agency reports on blockchain/digital-token consumer-protection issues and authorizes a CPSC AI pilot—together these votes further indicate support for agency-level reporting, mandated transparency, and using technology/agency reports to inform oversight. In the current batch voted Yea on H.Res.780 (the rule to consider H.R.1834 to advance policy priorities), demonstrating a willingness to back procedural rules to move legislation and reinforcing a mixed, selective approach to House procedural reforms. The member also voted No on H.Res.1009 (the rule to consider H.R.6945, H.R.6359, and H.J.Res.140), signaling opposition to allowing consideration of those specific measures and reflecting continued selectivity in supporting or opposing rules that advance particular bills. Additionally, in this batch the member voted Yea for an extension to FinCEN beneficial ownership reporting deadlines (Protect Small Businesses from Excessive Paperwork Act of 2025, H.R.736), indicating support for delaying regulatory compliance deadlines and easing paperwork burdens on small businesses.",
    "evidence": 21
  },
  "gun_control": {
    "summary": "Voted Nay on the Law-Enforcement Innovate to De-Escalate Act (HR-2189), opposing removing certain less-than-lethal projectile devices from regulation under the Gun Control Act; favors retaining regulatory oversight of such devices.",
    "evidence": 1
  },
  "health_care": {
    "summary": "Has an inconsistent stance on VA accessibility oversight (split votes on the Veterans Accessibility Advisory Committee Act). On health funding, voted Yea on the Consolidated Appropriations Act, 2026, which provided funding to HHS and extended several health care authorities; combined with earlier opposing votes on other funding measures, this indicates a mixed record on health funding and extensions. Also voted Yea on the Ernest Peltz Accrued Veterans Benefits Act and the Veterans Readiness and Employment Improvement Act of 2025, signaling support for improving VA benefits procedures and for modernizing veterans' access to counseling and employment supports. Recently voted Yea on the Honoring Our Heroes Act of 2025 to expand VA-provided headstones and burial markers to certain veterans who died before November 1, 1990, indicating support for expanding veterans' memorial and burial benefits. On gender-affirming care for minors the member's record is now mixed: earlier batches included a Nay on the Protect Children's Innocence Act (opposing federal criminalization), later recorded a Yea on that same bill, and in the current batch the member registered both a Yea and a Nay on the Do No Harm in Medicaid Act (which would prohibit federal Medicaid payment for specified gender-transition procedures for individuals under 18) — producing a conflicting record on whether to restrict Medicaid coverage for gender-affirming care for youth. In this batch the member voted Yea on H.R.5371 (which extended certain HHS and Indian Health Service authorities and provided targeted health-related appropriations through the CR) and voted Nay on the Protect Children's Innocence Act in earlier roll calls, demonstrating support for extending some public health program authorities and a conflicted stance on criminalizing gender-affirming care for minors. The member also voted Nay on multiple roll calls on other continuing-appropriations vehicles in prior batches. In this most recent batch the member voted Yea on the TRAVEL Act of 2025 to authorize VA traveling physicians to serve veterans in U.S. territories (American Samoa, Guam, Northern Mariana Islands, Puerto Rico, the U.S. Virgin Islands, and other territories), including relocation/retention bonuses, indicating support for expanding VA access and targeted staffing solutions to improve care for veterans in territories. Most recently the member voted Yea on H.R.6938, the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026, which included funding for the Indian Health Service—signaling support for FY2026 appropriations that maintain health program funding for tribal and IHS services. The member also voted Yea on the Medal of Honor Act (H.R.695) to increase the monthly special pension for living Medal of Honor recipients, indicating support for raising veterans' pensions and benefits.",
    "evidence": 20
  },
  "homeland_security": {
    "summary": "Shows a mixed approach to DHS funding: voted Yea on the Consolidated Appropriations Act, 2026 (which included a continuing resolution providing DHS funding through Feb 13, 2026), but voted Nay on the separate DHS appropriations bill (HR-7147). This indicates inconsistent positions on DHS funding vehicles and appropriations strategies. In this batch the member voted Yea on H.R.5371 (the FY2026 continuing-appropriations act), which extended DHS cyber authorities, the State and Local Cybersecurity Grant Program, and other DHS authorities through the CR period—so the member has both Yea and Nay votes across different DHS funding vehicles and continuations. Most recently the member voted Nay on H.Res.873 in a prior batch, underscoring a selective pattern of support and opposition for different DHS/cyber funding measures. The member also voted Yea on HR-4058 (Enhancing Stakeholder Support and Outreach for Preparedness Grants Act), supporting FEMA-provided outreach, technical assistance, annual surveys of public entities, and GAO reporting—indicating backing for improved stakeholder engagement and oversight of homeland-security grant programs. In the current batch the member voted Yea on the Personnel Oversight and Shift Tracking Act (POST Act), supporting FPS-mandated performance testing and improvement protocols for contract security personnel, evaluation of tracking systems, and reporting to Congress on implementation and annual follow-ups—reflecting support for strengthened oversight, accountability, and performance-improvement measures for federal building security contractors. Also in this batch the member voted Yea on the Strengthening Cyber Resilience Against State-Sponsored Threats Act to create a CISA-led interagency task force to detect, analyze, and respond to Chinese state-sponsored cyber actors and to provide annual reports and briefings to Congress, demonstrating support for coordinated DHS/CISA-led action and congressional reporting on state-sponsored cyber threats. The member also voted Yea on the Department of Homeland Security Vehicular Terrorism Prevention and Mitigation Act of 2025, supporting a DHS-led report (with TSA and CISA coordination), classified findings with an unclassified executive summary, congressional briefings, and recommendations for research, development, and deployment of technologies to detect, deter, and mitigate vehicular terrorism.",
    "evidence": 11
  },
  "immigration": {
    "summary": "Voted Yea on the SAVE Act, which would require documentary proof of U.S. citizenship for federal voter registration, indicating support for stricter proof-of-citizenship requirements tied to voter eligibility and a willingness to back federal documentation checks in the voter-registration process. More recently the member registered split votes (both Yea and Nay) on the Kayla Hamilton Act, which would require HHS to collect and share additional information about adult household residents, prohibit placement of unaccompanied alien children with sponsors who are unlawfully present, and require secure placements for certain older minors with gang-related indicators—indicating an inconsistent stance on imposing additional documentation, sponsor-eligibility restrictions, and placement mandates for unaccompanied children. The member also voted Nay on the Stop Illegal Entry Act of 2025, opposing the bill's significant new mandatory minimums and expanded criminal penalties for illegal entry and illegal reentry, signaling reluctance to expand criminal penalties for migration-related conduct.",
    "evidence": 4
  },
  "jobs": {
    "summary": "Selective pro-development stance: voted Yea on the Wabeno Economic Development Act supporting local land conveyance for economic activity, and voted Yea on the Mining Regulatory Clarity Act (HR-1366), indicating support for expanded mining operations and related economic activity. Also cast both Yea and Nay on the Critical Mineral Dominance Act, reflecting an inconsistent position on accelerating mining on federal lands as a jobs strategy tied to mineral supply chains. Additionally voted Yea on the AI for Main Street Act to help small businesses adopt AI and on the Veterans Readiness and Employment Improvement Act to modernize on-campus counseling for veterans, indicating support for workforce tools and small-business assistance to bolster employment and economic resilience. In this batch voted Yea on H.R.5371 (the FY2026 continuing-appropriations act), which provided full-year appropriations for agriculture and rural development titles and funding for USDA programs—demonstrating support for a continuing-resolution approach to sustaining farm, rural, and related jobs funding—while also casting Nay on bills like the REFINER Act and Unlocking our Domestic LNG Potential Act that would expand refinery or LNG-sector work. Also voted Nay on the DUMP Red Tape Act, opposing a statutory requirement for the SBA Office of Advocacy to maintain a Red Tape Hotline and annual reporting to Congress, which suggests some reluctance to back mandated regulatory-reporting measures intended to aid small businesses. Also voted Yea to convey a small parcel of Forest Service land to Perry County for public uses (education and youth development), indicating continued support for local land conveyances that can support community economic and public-purpose activities. Most recently registered both a Yea and a Nay on the FY2025 reconciliation package (H.R.1)  — which included multiple farm program and crop insurance changes — producing a split record on support for that package's agricultural and rural-economy provisions. In this batch the member also cast both Yea and Nay on the Power Plant Reliability Act of 2025, which could preserve plant jobs by allowing FERC to order plants to remain open and set cost-recovery rules; those split votes underscore an inconsistent record on job-preservation measures tied to energy regulation. In the current batch the member voted Yea on the Main Street Parity Act to reduce SBA equity requirements for certain small-business loans for plant acquisition, construction, conversion, or expansion—signaling support for easing small-business financing to spur local business growth and job-creating investments. The member also voted Yea on the Protect Small Businesses from Excessive Paperwork Act of 2025 (H.R.736) to extend the FinCEN beneficial-ownership information filing deadline for certain firms, indicating support for delaying regulatory compliance deadlines and reducing paperwork burdens on small businesses. In the current batch the member voted Yea on the Tipped Employee Protection Act (HR-2312) to broaden the FLSA definition of a tipped employee and also voted Yea on the Empowering Employer Child and Elder Care Solutions Act (HR-2270) to exclude employer-funded child or dependent care from overtime-rate calculations—together signaling support for employer-favored labor-rule changes that alter wage and overtime calculations and promote employer-provided care solutions. In this most recent batch the member registered both Yea and Nay votes on the Flexibility for Workers Education Act (H.R.2262), which would exclude certain voluntary outside-of-hours training from hours worked under the FLSA—indicating an inconsistent stance on employer-friendly labor-rule changes that would reduce overtime/payment obligations.",
    "evidence": 26
  },
  "principles_values": {
    "summary": "Voted Yea on a concurrent resolution denouncing socialism (HCONRES-58), signaling opposition to socialist policies and a rhetorical stance against implementing socialist approaches in the United States. Also voted Yea on the Hershel \"Woody\" Williams National Medal of Honor Monument Location Act (H.R.186), supporting locating the Medal of Honor monument within the Reserve on the National Mall, indicating support for prominent memorialization of veterans and honoring military service in a central public space.",
    "evidence": 2
  },
  "social_security": {
    "summary": "Voted Yea on the Social Security Child Protection Act of 2025 to direct SSA to issue a new Social Security number to a child under 14 if the child's SS card was lost or stolen while being mailed, indicating support for administrative fixes to protect children from identity-theft risks and to improve SSA procedures for vulnerable beneficiaries.",
    "evidence": 1
  },
  "tax_reform": {
    "summary": "Voted Nay on HJRES-142 to oppose nullifying D.C.'s decoupling from certain federal tax law changes (from H.R.1), signaling support for D.C.'s local tax choices (including restoring prior DC provisions) rather than reinstating specific federal tax provisions.",
    "evidence": 1
  },
  "technology": {
    "summary": "Mixed record on technology and tech funding: has cast both Nay and Yea on the Undersea Cable Protection Act and split votes on critical minerals legislation. Voted Yea on the Consolidated Appropriations Act, 2026 (which extended/funded the Technology Modernization Fund and other tech authorities) and voted Yea on the Energy and Water Development and Related Agencies Appropriations Act (HR-4553), which funds DOE tech programs—while also opposing other appropriations (e.g., HR-7147) indicating inconsistent support across different technology funding vehicles. Also voted Yea on the AI for Main Street Act, supporting Small Business Development Centers in helping small businesses evaluate and adopt artificial intelligence, indicating support for technology adoption and small-business tech assistance. Voted Nay on the GRID Power Act (oposing a FERC-directed prioritization of interconnection for 'dispatchable' projects), suggesting caution about regulatory changes that would prioritize certain types of generation in grid interconnection processes. Also voted Nay on the Electric Supply Chain Act, opposing a DOE requirement to periodically assess and report on electricity-generation-and-transmission supply chain vulnerabilities and recommendations on critical-mineral processing and related barriers—indicating reluctance to back additional DOE reporting/assessment mandates focused on securing electricity supply chains. In the most recent votes the member voted Yea on H.R.5371, which extended the State and Local Cybersecurity Grant Program and other cybersecurity authorities through the CR period, but in other batches the member voted Nay on certain continuing-appropriations packages that funded cybersecurity programs—demonstrating an inconsistent stance on tech- and cyber-related appropriations and procedural modernization measures. The member also voted Yea on the ANCHOR Act to require NSF to develop a plan to upgrade cybersecurity and telecommunications for the U.S. Academic Research Fleet, signaling support for federal action to modernize research infrastructure and protect research-networking. The member opposed congressional disapproval of a DOE appliance-efficiency/certification/labeling/enforcement rule (voted Nay on H.J.Res.42), indicating support for DOE's updated appliance-efficiency reporting and compliance requirements that affect consumer and commercial technologies. In this batch the member registered both Yea and Nay on the Power Plant Reliability Act of 2025, reflecting inconsistent views on regulatory interventions (FERC authority to order plant operation, advance-notice retirements, cost-recovery rules, and environmental-exemption provisions) intended to preserve grid reliability. The member voted Nay on the Anti-CBDC Surveillance State Act (HR-1919), opposing a statutory ban on Federal Reserve CBDC research/issuance and suggesting openness to allowing the Fed to study or develop central-bank digital-currency options rather than imposing an outright prohibition. The member also voted Yea on the Digital Asset Market Clarity Act (H.R.3633), supporting a CFTC-centered regulatory framework for digital commodities with AML and market-structure provisions, indicating backing for clearer crypto-market regulation and exchange oversight. In the current batch the member voted Yea on the Strengthening Cyber Resilience Against State-Sponsored Threats Act to establish a CISA-led interagency task force focused on Chinese state-sponsored cyber actors, and registered both Yea and Nay votes on the FY2026 NDAA/procurement vehicle (HR-3838), which included provisions on DOD cyber activities and AI — producing a mixed record on defense-related tech and cyber/AI policy within broader technology funding and oversight positions. Most recently the member voted Yea on the National Defense Authorization Act for Fiscal Year 2026 (S.1071) in two roll calls, reflecting support for FY2026 DOD cyber and AI policy provisions and for defense-related technology and procurement authorities. The member also voted Yea on the Communications Security Act, supporting statutory authority for an FCC advisory council on communications security, membership rules to exclude entities owned, controlled by, or influenced by foreign adversaries, and an exemption from the usual federal advisory-committee termination requirement—indicating support for institutionalized, security-focused FCC advisory mechanisms for communications networks. The member voted Yea on the Consumer Safety Technology Act to authorize a CPSC AI pilot for identifying product hazards, tracking injury trends, and monitoring recalled products, and to require Commerce and FTC reports on blockchain/digital-token consumer-protection issues—signaling support for using AI in consumer-safety oversight and for mandated interagency reporting on emerging digital-asset risks. Most recently the member registered both Yea and Nay on the SHOWER Act (HR-4593), which would adopt a revised DOE showerhead definition and require DOE to revise related water/efficiency regulations—demonstrating an inconsistent stance on DOE appliance/water-efficiency regulatory-definition changes. The member also voted Yea on H.R.6938 (the Commerce-Justice-Science; Energy and Water; and Interior/Environment appropriations bill for FY2026), supporting FY2026 funding for NSF, NASA, and Commerce-related science/technology programs—reinforcing support for appropriations that advance federal research, science, and technology capabilities. The member voted Yea on the Remote Access Security Act (HR-2683) to broaden export controls to include remote access to U.S.-jurisdiction items, indicating support for expanding export-control authorities to cover digital/remote access to sensitive dual-use technologies and strengthen protections against foreign access. The member also voted Nay on the Affordable HOMES Act (HR-5184), opposing rescission of DOE energy-efficiency regulations for manufactured housing and reinforcing support for federal appliance-efficiency standards.",
    "evidence": 39
  },
  "war_peace": {
    "summary": "Mixed and inconsistent stance on defense and wartime funding: cast both Yea and Nay on the Department of Defense Appropriations Act, 2026 (HR-4016), indicating an inconsistent approach to supporting military appropriations. Voted Yea on H.R.5371 (the FY2026 continuing-appropriations act), which included certain DOD funding constraints and continuing authorities, further illustrating a split pattern of support across different defense funding vehicles. This split on DoD funding suggests ambiguity in willingness to back defense spending despite other foreign-policy votes that have signaled hawkish positions. In the current batch the member also registered both a Yea and a Nay on the FY2026 NDAA/procurement bill (HR-3838), reinforcing the inconsistent pattern on authorization and procurement policies that shape U.S. defense posture and acquisitions. The member also voted Yea on concurrent resolutions directing the removal of U.S. Armed Forces from Venezuela that have not been authorized by Congress (H.Con.Res.64 and H.Con.Res.68), indicating a preference for requiring congressional authorization before sustaining or continuing U.S. military involvement in Venezuela and a posture of restraint regarding unauthorized deployments. Most recently the member voted Yea on the National Defense Authorization Act for Fiscal Year 2026 (S.1071) in two roll calls, demonstrating a willingness to support FY2026 DOD policies and authorities across procurement, personnel, acquisitions, and defense cyber/AI provisions.",
    "evidence": 12
  },
  "welfare_poverty": {
    "summary": "Voted Yea on the Housing for the 21st Century Act, supporting expanded financing and grants for affordable housing, increasing HOME program income eligibility, and establishing pilot programs and grants to assist public housing and low-income households. Cast both Yea and Nay on the Supporting Pregnant and Parenting Women and Families Act (which would allow TANF funds to be used for pregnancy centers), indicating an inconsistent stance on allowable TANF uses and support for certain types of services for pregnant and parenting families. Most recently registered both a Yea and a Nay on the FY2025 reconciliation bill (H.R.1), opposing some elements while supporting or voting for others in separate roll calls — the bill included major SNAP changes (work requirements, state matching, deductions limits), forestry/conservation rescissions, and agricultural program changes — producing a split record that suggests ambivalence or selective agreement/disagreement with major proposed changes to nutrition and conservation programs. In this batch the member voted Yea on H.R.5371 (the FY2026 continuing-appropriations act), which included SNAP/state-variety provisions and extended nutrition-program authorities through the CR period. The member also voted No on the rule (H.Res.1009) that would have allowed consideration of H.R.6945 (clarifying State authority to use funds for pregnancy centers), signaling opposition to advancing that specific TANF-related bill.",
    "evidence": 11
  }
}